7767517
274 346
Input                    in0                      0 1 in0
Convolution              convrelu_0               1 1 in0 1 0=32 1=3 11=3 12=1 13=2 14=1 2=1 3=2 4=1 5=1 6=864 9=1
Convolution              convrelu_1               1 1 1 2 0=64 1=3 11=3 12=1 13=2 14=1 2=1 3=2 4=1 5=1 6=18432 9=1
Convolution              convrelu_2               1 1 2 3 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=8192 9=1
Slice                    chunk_0                  1 2 3 4 5 -23300=2,-233,-233 1=0
Split                    splitncnn_0              1 3 5 6 7 8
Convolution              convrelu_3               1 1 8 9 0=32 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=2048 9=1
Split                    splitncnn_1              1 2 9 10 11
Convolution              convrelu_4               1 1 11 12 0=32 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=9216 9=1
Convolution              convrelu_5               1 1 12 13 0=32 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=9216 9=1
BinaryOp                 add_0                    2 1 10 13 14 0=0
Convolution              convrelu_6               1 1 7 15 0=32 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=2048 9=1
Concat                   cat_0                    2 1 14 15 16 0=0
Convolution              convrelu_7               1 1 16 17 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=4096 9=1
Convolution              convrelu_8               1 1 17 18 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=36864 9=1
Split                    splitncnn_2              1 3 18 19 20 21
Convolution              convrelu_9               1 1 21 22 0=32 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=2048 9=1
Split                    splitncnn_3              1 2 22 23 24
Convolution              convrelu_10              1 1 24 25 0=32 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=9216 9=1
Convolution              convrelu_11              1 1 25 26 0=32 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=9216 9=1
BinaryOp                 add_1                    2 1 23 26 27 0=0
Convolution              convrelu_12              1 1 20 28 0=32 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=2048 9=1
Concat                   cat_1                    2 1 27 28 29 0=0
Convolution              convrelu_13              1 1 29 30 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=4096 9=1
Convolution              convrelu_14              1 1 30 31 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=36864 9=1
Concat                   cat_2                    4 1 4 6 19 31 32 0=0
Convolution              convrelu_15              1 1 32 33 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=32768 9=1
Pooling                  avgpool2d_0              1 1 33 34 0=1 1=2 11=2 12=1 13=0 2=1 3=0 5=1 6=1
Convolution              convrelu_16              1 1 34 35 0=240 1=3 11=3 12=1 13=2 14=1 2=1 3=2 4=1 5=1 6=276480 9=1
Convolution              convrelu_17              1 1 35 36 0=240 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=57600 9=1
Slice                    chunk_1                  1 2 36 37 38 -23300=2,-233,-233 1=0
Split                    splitncnn_4              1 3 38 39 40 41
Convolution              convrelu_18              1 1 41 42 0=60 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=7200 9=1
Split                    splitncnn_5              1 2 42 43 44
Convolution              convrelu_19              1 1 44 45 0=60 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=32400 9=1
Convolution              convrelu_20              1 1 45 46 0=60 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=32400 9=1
BinaryOp                 add_2                    2 1 43 46 47 0=0
Convolution              convrelu_21              1 1 40 48 0=60 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=7200 9=1
Concat                   cat_3                    2 1 47 48 49 0=0
Convolution              convrelu_22              1 1 49 50 0=120 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=14400 9=1
Convolution              convrelu_23              1 1 50 51 0=120 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=129600 9=1
Split                    splitncnn_6              1 3 51 52 53 54
Convolution              convrelu_24              1 1 54 55 0=60 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=7200 9=1
Split                    splitncnn_7              1 2 55 56 57
Convolution              convrelu_25              1 1 57 58 0=60 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=32400 9=1
Convolution              convrelu_26              1 1 58 59 0=60 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=32400 9=1
BinaryOp                 add_3                    2 1 56 59 60 0=0
Convolution              convrelu_27              1 1 53 61 0=60 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=7200 9=1
Concat                   cat_4                    2 1 60 61 62 0=0
Convolution              convrelu_28              1 1 62 63 0=120 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=14400 9=1
Convolution              convrelu_29              1 1 63 64 0=120 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=129600 9=1
Concat                   cat_5                    4 1 37 39 52 64 65 0=0
Convolution              convrelu_30              1 1 65 66 0=240 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=115200 9=1
Split                    splitncnn_8              1 2 66 67 68
Pooling                  avgpool2d_1              1 1 68 69 0=1 1=2 11=2 12=1 13=0 2=1 3=0 5=1 6=1
Convolution              convrelu_31              1 1 69 70 0=360 1=3 11=3 12=1 13=2 14=1 2=1 3=2 4=1 5=1 6=777600 9=1
Convolution              convrelu_32              1 1 70 71 0=360 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=129600 9=1
Slice                    chunk_2                  1 2 71 72 73 -23300=2,-233,-233 1=0
Split                    splitncnn_9              1 3 73 74 75 76
Convolution              convrelu_33              1 1 76 77 0=90 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=16200 9=1
Split                    splitncnn_10             1 2 77 78 79
Convolution              convrelu_34              1 1 79 80 0=90 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=72900 9=1
Convolution              convrelu_35              1 1 80 81 0=90 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=72900 9=1
BinaryOp                 add_4                    2 1 78 81 82 0=0
Convolution              convrelu_36              1 1 75 83 0=90 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=16200 9=1
Concat                   cat_6                    2 1 82 83 84 0=0
Convolution              convrelu_37              1 1 84 85 0=180 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=32400 9=1
Convolution              convrelu_38              1 1 85 86 0=180 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=291600 9=1
Split                    splitncnn_11             1 3 86 87 88 89
Convolution              convrelu_39              1 1 89 90 0=90 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=16200 9=1
Split                    splitncnn_12             1 2 90 91 92
Convolution              convrelu_40              1 1 92 93 0=90 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=72900 9=1
Convolution              convrelu_41              1 1 93 94 0=90 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=72900 9=1
BinaryOp                 add_5                    2 1 91 94 95 0=0
Convolution              convrelu_42              1 1 88 96 0=90 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=16200 9=1
Concat                   cat_7                    2 1 95 96 97 0=0
Convolution              convrelu_43              1 1 97 98 0=180 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=32400 9=1
Convolution              convrelu_44              1 1 98 99 0=180 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=291600 9=1
Concat                   cat_8                    4 1 72 74 87 99 100 0=0
Convolution              convrelu_45              1 1 100 101 0=360 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=259200 9=1
Split                    splitncnn_13             1 2 101 102 103
Pooling                  avgpool2d_2              1 1 103 104 0=1 1=2 11=2 12=1 13=0 2=1 3=0 5=1 6=1
Convolution              convrelu_46              1 1 104 105 0=480 1=3 11=3 12=1 13=2 14=1 2=1 3=2 4=1 5=1 6=1555200 9=1
Convolution              convrelu_47              1 1 105 106 0=480 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=230400 9=1
Slice                    chunk_3                  1 2 106 107 108 -23300=2,-233,-233 1=0
Split                    splitncnn_14             1 3 108 109 110 111
Convolution              convrelu_48              1 1 111 112 0=120 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=28800 9=1
Split                    splitncnn_15             1 2 112 113 114
Convolution              convrelu_49              1 1 114 115 0=120 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=129600 9=1
Convolution              convrelu_50              1 1 115 116 0=120 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=129600 9=1
BinaryOp                 add_6                    2 1 113 116 117 0=0
Convolution              convrelu_51              1 1 110 118 0=120 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=28800 9=1
Concat                   cat_9                    2 1 117 118 119 0=0
Convolution              convrelu_52              1 1 119 120 0=240 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=57600 9=1
Convolution              convrelu_53              1 1 120 121 0=240 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=518400 9=1
Split                    splitncnn_16             1 3 121 122 123 124
Convolution              convrelu_54              1 1 124 125 0=120 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=28800 9=1
Split                    splitncnn_17             1 2 125 126 127
Convolution              convrelu_55              1 1 127 128 0=120 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=129600 9=1
Convolution              convrelu_56              1 1 128 129 0=120 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=129600 9=1
BinaryOp                 add_7                    2 1 126 129 130 0=0
Convolution              convrelu_57              1 1 123 131 0=120 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=28800 9=1
Concat                   cat_10                   2 1 130 131 132 0=0
Convolution              convrelu_58              1 1 132 133 0=240 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=57600 9=1
Convolution              convrelu_59              1 1 133 134 0=240 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=518400 9=1
Concat                   cat_11                   4 1 107 109 122 134 135 0=0
Convolution              convrelu_60              1 1 135 136 0=480 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=460800 9=1
Convolution              convrelu_61              1 1 136 137 0=240 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=115200 9=1
Split                    splitncnn_18             1 2 137 138 139
Pooling                  maxpool2d_141            1 1 139 140 0=0 1=5 11=5 12=1 13=2 2=1 3=2 5=1
Split                    splitncnn_19             1 2 140 141 142
Pooling                  maxpool2d_142            1 1 142 143 0=0 1=5 11=5 12=1 13=2 2=1 3=2 5=1
Split                    splitncnn_20             1 2 143 144 145
Pooling                  maxpool2d_143            1 1 145 146 0=0 1=5 11=5 12=1 13=2 2=1 3=2 5=1
Concat                   cat_12                   4 1 138 141 144 146 147 0=0
Convolution              convrelu_62              1 1 147 148 0=480 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=460800 9=1
Split                    splitncnn_21             1 2 148 149 150
Interp                   upsample_277             1 1 150 151 0=1 1=2.000000e+00 2=2.000000e+00 6=0
Concat                   cat_13                   2 1 151 102 152 0=0
Convolution              convrelu_63              1 1 152 153 0=360 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=302400 9=1
Slice                    chunk_4                  1 2 153 154 155 -23300=2,-233,-233 1=0
Split                    splitncnn_22             1 3 155 156 157 158
Convolution              convrelu_64              1 1 158 159 0=90 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=16200 9=1
Split                    splitncnn_23             1 2 159 160 161
Convolution              convrelu_65              1 1 161 162 0=90 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=72900 9=1
Convolution              convrelu_66              1 1 162 163 0=90 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=72900 9=1
BinaryOp                 add_8                    2 1 160 163 164 0=0
Convolution              convrelu_67              1 1 157 165 0=90 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=16200 9=1
Concat                   cat_14                   2 1 164 165 166 0=0
Convolution              convrelu_68              1 1 166 167 0=180 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=32400 9=1
Convolution              convrelu_69              1 1 167 168 0=180 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=291600 9=1
Split                    splitncnn_24             1 3 168 169 170 171
Convolution              convrelu_70              1 1 171 172 0=90 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=16200 9=1
Split                    splitncnn_25             1 2 172 173 174
Convolution              convrelu_71              1 1 174 175 0=90 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=72900 9=1
Convolution              convrelu_72              1 1 175 176 0=90 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=72900 9=1
BinaryOp                 add_9                    2 1 173 176 177 0=0
Convolution              convrelu_73              1 1 170 178 0=90 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=16200 9=1
Concat                   cat_15                   2 1 177 178 179 0=0
Convolution              convrelu_74              1 1 179 180 0=180 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=32400 9=1
Convolution              convrelu_75              1 1 180 181 0=180 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=291600 9=1
Concat                   cat_16                   4 1 154 156 169 181 182 0=0
Convolution              convrelu_76              1 1 182 183 0=360 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=259200 9=1
Split                    splitncnn_26             1 2 183 184 185
Interp                   upsample_278             1 1 185 186 0=1 1=2.000000e+00 2=2.000000e+00 6=0
Concat                   cat_17                   2 1 186 67 187 0=0
Convolution              convrelu_77              1 1 187 188 0=240 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=144000 9=1
Slice                    chunk_5                  1 2 188 189 190 -23300=2,-233,-233 1=0
Split                    splitncnn_27             1 3 190 191 192 193
Convolution              convrelu_78              1 1 193 194 0=60 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=7200 9=1
Split                    splitncnn_28             1 2 194 195 196
Convolution              convrelu_79              1 1 196 197 0=60 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=32400 9=1
Convolution              convrelu_80              1 1 197 198 0=60 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=32400 9=1
BinaryOp                 add_10                   2 1 195 198 199 0=0
Convolution              convrelu_81              1 1 192 200 0=60 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=7200 9=1
Concat                   cat_18                   2 1 199 200 201 0=0
Convolution              convrelu_82              1 1 201 202 0=120 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=14400 9=1
Convolution              convrelu_83              1 1 202 203 0=120 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=129600 9=1
Split                    splitncnn_29             1 3 203 204 205 206
Convolution              convrelu_84              1 1 206 207 0=60 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=7200 9=1
Split                    splitncnn_30             1 2 207 208 209
Convolution              convrelu_85              1 1 209 210 0=60 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=32400 9=1
Convolution              convrelu_86              1 1 210 211 0=60 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=32400 9=1
BinaryOp                 add_11                   2 1 208 211 212 0=0
Convolution              convrelu_87              1 1 205 213 0=60 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=7200 9=1
Concat                   cat_19                   2 1 212 213 214 0=0
Convolution              convrelu_88              1 1 214 215 0=120 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=14400 9=1
Convolution              convrelu_89              1 1 215 216 0=120 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=129600 9=1
Concat                   cat_20                   4 1 189 191 204 216 217 0=0
Convolution              convrelu_90              1 1 217 218 0=240 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=115200 9=1
Split                    splitncnn_31             1 3 218 219 220 221
Pooling                  avgpool2d_3              1 1 219 222 0=1 1=2 11=2 12=1 13=0 2=1 3=0 5=1 6=1
Convolution              convrelu_91              1 1 222 223 0=184 1=3 11=3 12=1 13=2 14=1 2=1 3=2 4=1 5=1 6=397440 9=1
Concat                   cat_21                   2 1 223 184 224 0=0
Convolution              convrelu_92              1 1 224 225 0=360 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=195840 9=1
Slice                    chunk_6                  1 2 225 226 227 -23300=2,-233,-233 1=0
Split                    splitncnn_32             1 3 227 228 229 230
Convolution              convrelu_93              1 1 230 231 0=90 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=16200 9=1
Split                    splitncnn_33             1 2 231 232 233
Convolution              convrelu_94              1 1 233 234 0=90 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=72900 9=1
Convolution              convrelu_95              1 1 234 235 0=90 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=72900 9=1
BinaryOp                 add_12                   2 1 232 235 236 0=0
Convolution              convrelu_96              1 1 229 237 0=90 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=16200 9=1
Concat                   cat_22                   2 1 236 237 238 0=0
Convolution              convrelu_97              1 1 238 239 0=180 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=32400 9=1
Convolution              convrelu_98              1 1 239 240 0=180 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=291600 9=1
Split                    splitncnn_34             1 3 240 241 242 243
Convolution              convrelu_99              1 1 243 244 0=90 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=16200 9=1
Split                    splitncnn_35             1 2 244 245 246
Convolution              convrelu_100             1 1 246 247 0=90 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=72900 9=1
Convolution              convrelu_101             1 1 247 248 0=90 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=72900 9=1
BinaryOp                 add_13                   2 1 245 248 249 0=0
Convolution              convrelu_102             1 1 242 250 0=90 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=16200 9=1
Concat                   cat_23                   2 1 249 250 251 0=0
Convolution              convrelu_103             1 1 251 252 0=180 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=32400 9=1
Convolution              convrelu_104             1 1 252 253 0=180 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=291600 9=1
Concat                   cat_24                   4 1 226 228 241 253 254 0=0
Convolution              convrelu_105             1 1 254 255 0=360 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=259200 9=1
Split                    splitncnn_36             1 3 255 256 257 258
Pooling                  avgpool2d_4              1 1 256 259 0=1 1=2 11=2 12=1 13=0 2=1 3=0 5=1 6=1
Convolution              convrelu_106             1 1 259 260 0=240 1=3 11=3 12=1 13=2 14=1 2=1 3=2 4=1 5=1 6=777600 9=1
Concat                   cat_25                   2 1 260 149 261 0=0
Convolution              convrelu_107             1 1 261 262 0=480 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=345600 9=1
Slice                    chunk_7                  1 2 262 263 264 -23300=2,-233,-233 1=0
Split                    splitncnn_37             1 3 264 265 266 267
Convolution              convrelu_108             1 1 267 268 0=120 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=28800 9=1
Split                    splitncnn_38             1 2 268 269 270
Convolution              convrelu_109             1 1 270 271 0=120 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=129600 9=1
Convolution              convrelu_110             1 1 271 272 0=120 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=129600 9=1
BinaryOp                 add_14                   2 1 269 272 273 0=0
Convolution              convrelu_111             1 1 266 274 0=120 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=28800 9=1
Concat                   cat_26                   2 1 273 274 275 0=0
Convolution              convrelu_112             1 1 275 276 0=240 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=57600 9=1
Convolution              convrelu_113             1 1 276 277 0=240 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=518400 9=1
Split                    splitncnn_39             1 3 277 278 279 280
Convolution              convrelu_114             1 1 280 281 0=120 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=28800 9=1
Split                    splitncnn_40             1 2 281 282 283
Convolution              convrelu_115             1 1 283 284 0=120 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=129600 9=1
Convolution              convrelu_116             1 1 284 285 0=120 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=129600 9=1
BinaryOp                 add_15                   2 1 282 285 286 0=0
Convolution              convrelu_117             1 1 279 287 0=120 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=28800 9=1
Concat                   cat_27                   2 1 286 287 288 0=0
Convolution              convrelu_118             1 1 288 289 0=240 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=57600 9=1
Convolution              convrelu_119             1 1 289 290 0=240 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=518400 9=1
Concat                   cat_28                   4 1 263 265 278 290 291 0=0
Convolution              convrelu_120             1 1 291 292 0=480 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=460800 9=1
Split                    splitncnn_41             1 2 292 293 294
MemoryData               pnnx_216                 0 1 295 0=2100
Convolution              convrelu_121             1 1 221 296 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=138240 9=1
ConvolutionDepthWise     convdwrelu_0             1 1 296 297 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=9216 7=4 9=1
ConvolutionDepthWise     convdw_287               1 1 297 298 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=1024 7=4
Convolution              convrelu_122             1 1 220 299 0=240 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=518400 9=1
Convolution              convrelu_123             1 1 299 300 0=240 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=518400 9=1
Convolution              conv_131                 1 1 300 301 0=3 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=720
Concat                   cat_29                   2 1 298 301 302 0=0
Convolution              convrelu_124             1 1 258 303 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=207360 9=1
ConvolutionDepthWise     convdwrelu_1             1 1 303 304 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=9216 7=4 9=1
ConvolutionDepthWise     convdw_289               1 1 304 305 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=1024 7=4
Convolution              convrelu_125             1 1 257 306 0=240 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=777600 9=1
Convolution              convrelu_126             1 1 306 307 0=240 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=518400 9=1
Convolution              conv_135                 1 1 307 308 0=3 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=720
Concat                   cat_30                   2 1 305 308 309 0=0
Convolution              convrelu_127             1 1 294 310 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=276480 9=1
ConvolutionDepthWise     convdwrelu_2             1 1 310 311 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=9216 7=4 9=1
ConvolutionDepthWise     convdw_291               1 1 311 312 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=1024 7=4
Convolution              convrelu_128             1 1 293 313 0=240 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=1036800 9=1
Convolution              convrelu_129             1 1 313 314 0=240 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=518400 9=1
Convolution              conv_139                 1 1 314 315 0=3 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=720
Concat                   cat_31                   2 1 312 315 316 0=0
Reshape                  view_280                 1 1 302 317 0=1600 1=67
Reshape                  view_281                 1 1 309 318 0=400 1=67
Reshape                  view_282                 1 1 316 319 0=100 1=67
Concat                   cat_32                   3 1 317 318 319 320 0=1
Slice                    split_0                  1 2 320 321 322 -23300=2,64,3 1=0
Reshape                  view_283                 1 1 321 323 0=2100 1=16 2=4
Permute                  transpose_285            1 1 323 324 0=2
Softmax                  softmax_6                1 1 324 325 0=0 1=1
Convolution              conv_140                 1 1 325 326 0=1 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=0 6=16
Reshape                  view_284                 1 1 326 327 0=2100 1=4
MemoryData               pnnx_fold_anchor_points.1 0 1 328 0=2100 1=2
MemoryData               pnnx_fold_anchor_points.1_1 0 1 329 0=2100 1=2
Slice                    split_1                  1 2 327 330 331 -23300=2,2,-233 1=0
BinaryOp                 sub_16                   2 1 328 330 332 0=1
Split                    splitncnn_42             1 2 332 333 334
BinaryOp                 add_17                   2 1 329 331 335 0=0
Split                    splitncnn_43             1 2 335 336 337
BinaryOp                 add_18                   2 1 333 336 338 0=0
BinaryOp                 div_19                   1 1 338 339 0=3 1=1 2=2.000000e+00
BinaryOp                 sub_20                   2 1 337 334 340 0=1
Concat                   cat_33                   2 1 339 340 341 0=0
Reshape                  reshape_279              1 1 295 342 0=2100 1=1
BinaryOp                 mul_21                   2 1 341 342 343 0=2
Sigmoid                  sigmoid_5                1 1 322 344
Concat                   cat_34                   2 1 343 344 out0 0=0
