7767517
294 371
Input                    in0                      0 1 in0
Convolution              convrelu_0               1 1 in0 1 0=64 1=3 11=3 12=1 13=2 14=1 2=1 3=2 4=1 5=1 6=1728 9=1
Convolution              convrelu_1               1 1 1 2 0=128 1=3 11=3 12=1 13=2 14=1 2=1 3=2 4=1 5=1 6=73728 9=1
Convolution              convrelu_2               1 1 2 3 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=16384 9=1
Slice                    chunk_0                  1 2 3 4 5 -23300=2,-233,-233 1=0
Split                    splitncnn_0              1 3 5 6 7 8
Convolution              convrelu_3               1 1 8 9 0=32 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=2048 9=1
Split                    splitncnn_1              1 2 9 10 11
Convolution              convrelu_4               1 1 11 12 0=32 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=9216 9=1
Convolution              convrelu_5               1 1 12 13 0=32 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=9216 9=1
BinaryOp                 add_0                    2 1 10 13 14 0=0
Convolution              convrelu_6               1 1 7 15 0=32 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=2048 9=1
Concat                   cat_0                    2 1 14 15 16 0=0
Convolution              convrelu_7               1 1 16 17 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=4096 9=1
Convolution              convrelu_8               1 1 17 18 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=36864 9=1
Split                    splitncnn_2              1 3 18 19 20 21
Convolution              convrelu_9               1 1 21 22 0=32 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=2048 9=1
Split                    splitncnn_3              1 2 22 23 24
Convolution              convrelu_10              1 1 24 25 0=32 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=9216 9=1
Convolution              convrelu_11              1 1 25 26 0=32 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=9216 9=1
BinaryOp                 add_1                    2 1 23 26 27 0=0
Convolution              convrelu_12              1 1 20 28 0=32 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=2048 9=1
Concat                   cat_1                    2 1 27 28 29 0=0
Convolution              convrelu_13              1 1 29 30 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=4096 9=1
Convolution              convrelu_14              1 1 30 31 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=36864 9=1
Concat                   cat_2                    4 1 4 6 19 31 32 0=0
Convolution              convrelu_15              1 1 32 33 0=256 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=65536 9=1
Pooling                  avgpool2d_0              1 1 33 34 0=1 1=2 11=2 12=1 13=0 2=1 3=0 5=1 6=1
Slice                    chunk_1                  1 2 34 35 36 -23300=2,-233,-233 1=0
Convolution              convrelu_16              1 1 35 37 0=128 1=3 11=3 12=1 13=2 14=1 2=1 3=2 4=1 5=1 6=147456 9=1
Pooling                  maxpool2d_5              1 1 36 38 0=0 1=3 11=3 12=2 13=1 2=2 3=1 5=1
Convolution              convrelu_17              1 1 38 39 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=16384 9=1
Concat                   cat_3                    2 1 37 39 40 0=0
Convolution              convrelu_18              1 1 40 41 0=256 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=65536 9=1
Slice                    chunk_2                  1 2 41 42 43 -23300=2,-233,-233 1=0
Split                    splitncnn_4              1 3 43 44 45 46
Convolution              convrelu_19              1 1 46 47 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=8192 9=1
Split                    splitncnn_5              1 2 47 48 49
Convolution              convrelu_20              1 1 49 50 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=36864 9=1
Convolution              convrelu_21              1 1 50 51 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=36864 9=1
BinaryOp                 add_2                    2 1 48 51 52 0=0
Convolution              convrelu_22              1 1 45 53 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=8192 9=1
Concat                   cat_4                    2 1 52 53 54 0=0
Convolution              convrelu_23              1 1 54 55 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=16384 9=1
Convolution              convrelu_24              1 1 55 56 0=128 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=147456 9=1
Split                    splitncnn_6              1 3 56 57 58 59
Convolution              convrelu_25              1 1 59 60 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=8192 9=1
Split                    splitncnn_7              1 2 60 61 62
Convolution              convrelu_26              1 1 62 63 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=36864 9=1
Convolution              convrelu_27              1 1 63 64 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=36864 9=1
BinaryOp                 add_3                    2 1 61 64 65 0=0
Convolution              convrelu_28              1 1 58 66 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=8192 9=1
Concat                   cat_5                    2 1 65 66 67 0=0
Convolution              convrelu_29              1 1 67 68 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=16384 9=1
Convolution              convrelu_30              1 1 68 69 0=128 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=147456 9=1
Concat                   cat_6                    4 1 42 44 57 69 70 0=0
Convolution              convrelu_31              1 1 70 71 0=512 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=262144 9=1
Split                    splitncnn_8              1 2 71 72 73
Pooling                  avgpool2d_1              1 1 73 74 0=1 1=2 11=2 12=1 13=0 2=1 3=0 5=1 6=1
Slice                    chunk_3                  1 2 74 75 76 -23300=2,-233,-233 1=0
Convolution              convrelu_32              1 1 75 77 0=256 1=3 11=3 12=1 13=2 14=1 2=1 3=2 4=1 5=1 6=589824 9=1
Pooling                  maxpool2d_6              1 1 76 78 0=0 1=3 11=3 12=2 13=1 2=2 3=1 5=1
Convolution              convrelu_33              1 1 78 79 0=256 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=65536 9=1
Concat                   cat_7                    2 1 77 79 80 0=0
Convolution              convrelu_34              1 1 80 81 0=512 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=262144 9=1
Slice                    chunk_4                  1 2 81 82 83 -23300=2,-233,-233 1=0
Split                    splitncnn_9              1 3 83 84 85 86
Convolution              convrelu_35              1 1 86 87 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=32768 9=1
Split                    splitncnn_10             1 2 87 88 89
Convolution              convrelu_36              1 1 89 90 0=128 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=147456 9=1
Convolution              convrelu_37              1 1 90 91 0=128 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=147456 9=1
BinaryOp                 add_4                    2 1 88 91 92 0=0
Convolution              convrelu_38              1 1 85 93 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=32768 9=1
Concat                   cat_8                    2 1 92 93 94 0=0
Convolution              convrelu_39              1 1 94 95 0=256 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=65536 9=1
Convolution              convrelu_40              1 1 95 96 0=256 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=589824 9=1
Split                    splitncnn_11             1 3 96 97 98 99
Convolution              convrelu_41              1 1 99 100 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=32768 9=1
Split                    splitncnn_12             1 2 100 101 102
Convolution              convrelu_42              1 1 102 103 0=128 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=147456 9=1
Convolution              convrelu_43              1 1 103 104 0=128 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=147456 9=1
BinaryOp                 add_5                    2 1 101 104 105 0=0
Convolution              convrelu_44              1 1 98 106 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=32768 9=1
Concat                   cat_9                    2 1 105 106 107 0=0
Convolution              convrelu_45              1 1 107 108 0=256 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=65536 9=1
Convolution              convrelu_46              1 1 108 109 0=256 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=589824 9=1
Concat                   cat_10                   4 1 82 84 97 109 110 0=0
Convolution              convrelu_47              1 1 110 111 0=512 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=524288 9=1
Split                    splitncnn_13             1 2 111 112 113
Pooling                  avgpool2d_2              1 1 113 114 0=1 1=2 11=2 12=1 13=0 2=1 3=0 5=1 6=1
Slice                    chunk_5                  1 2 114 115 116 -23300=2,-233,-233 1=0
Convolution              convrelu_48              1 1 115 117 0=256 1=3 11=3 12=1 13=2 14=1 2=1 3=2 4=1 5=1 6=589824 9=1
Pooling                  maxpool2d_7              1 1 116 118 0=0 1=3 11=3 12=2 13=1 2=2 3=1 5=1
Convolution              convrelu_49              1 1 118 119 0=256 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=65536 9=1
Concat                   cat_11                   2 1 117 119 120 0=0
Convolution              convrelu_50              1 1 120 121 0=512 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=262144 9=1
Slice                    chunk_6                  1 2 121 122 123 -23300=2,-233,-233 1=0
Split                    splitncnn_14             1 3 123 124 125 126
Convolution              convrelu_51              1 1 126 127 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=32768 9=1
Split                    splitncnn_15             1 2 127 128 129
Convolution              convrelu_52              1 1 129 130 0=128 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=147456 9=1
Convolution              convrelu_53              1 1 130 131 0=128 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=147456 9=1
BinaryOp                 add_6                    2 1 128 131 132 0=0
Convolution              convrelu_54              1 1 125 133 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=32768 9=1
Concat                   cat_12                   2 1 132 133 134 0=0
Convolution              convrelu_55              1 1 134 135 0=256 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=65536 9=1
Convolution              convrelu_56              1 1 135 136 0=256 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=589824 9=1
Split                    splitncnn_16             1 3 136 137 138 139
Convolution              convrelu_57              1 1 139 140 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=32768 9=1
Split                    splitncnn_17             1 2 140 141 142
Convolution              convrelu_58              1 1 142 143 0=128 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=147456 9=1
Convolution              convrelu_59              1 1 143 144 0=128 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=147456 9=1
BinaryOp                 add_7                    2 1 141 144 145 0=0
Convolution              convrelu_60              1 1 138 146 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=32768 9=1
Concat                   cat_13                   2 1 145 146 147 0=0
Convolution              convrelu_61              1 1 147 148 0=256 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=65536 9=1
Convolution              convrelu_62              1 1 148 149 0=256 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=589824 9=1
Concat                   cat_14                   4 1 122 124 137 149 150 0=0
Convolution              convrelu_63              1 1 150 151 0=512 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=524288 9=1
Convolution              convrelu_64              1 1 151 152 0=256 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=131072 9=1
Split                    splitncnn_18             1 2 152 153 154
Pooling                  maxpool2d_151            1 1 154 155 0=0 1=5 11=5 12=1 13=2 2=1 3=2 5=1
Split                    splitncnn_19             1 2 155 156 157
Pooling                  maxpool2d_152            1 1 157 158 0=0 1=5 11=5 12=1 13=2 2=1 3=2 5=1
Split                    splitncnn_20             1 2 158 159 160
Pooling                  maxpool2d_153            1 1 160 161 0=0 1=5 11=5 12=1 13=2 2=1 3=2 5=1
Concat                   cat_15                   4 1 153 156 159 161 162 0=0
Convolution              convrelu_65              1 1 162 163 0=512 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=524288 9=1
Split                    splitncnn_21             1 2 163 164 165
Interp                   upsample_292             1 1 165 166 0=1 1=2.000000e+00 2=2.000000e+00 6=0
Concat                   cat_16                   2 1 166 112 167 0=0
Convolution              convrelu_66              1 1 167 168 0=512 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=524288 9=1
Slice                    chunk_7                  1 2 168 169 170 -23300=2,-233,-233 1=0
Split                    splitncnn_22             1 3 170 171 172 173
Convolution              convrelu_67              1 1 173 174 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=32768 9=1
Split                    splitncnn_23             1 2 174 175 176
Convolution              convrelu_68              1 1 176 177 0=128 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=147456 9=1
Convolution              convrelu_69              1 1 177 178 0=128 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=147456 9=1
BinaryOp                 add_8                    2 1 175 178 179 0=0
Convolution              convrelu_70              1 1 172 180 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=32768 9=1
Concat                   cat_17                   2 1 179 180 181 0=0
Convolution              convrelu_71              1 1 181 182 0=256 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=65536 9=1
Convolution              convrelu_72              1 1 182 183 0=256 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=589824 9=1
Split                    splitncnn_24             1 3 183 184 185 186
Convolution              convrelu_73              1 1 186 187 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=32768 9=1
Split                    splitncnn_25             1 2 187 188 189
Convolution              convrelu_74              1 1 189 190 0=128 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=147456 9=1
Convolution              convrelu_75              1 1 190 191 0=128 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=147456 9=1
BinaryOp                 add_9                    2 1 188 191 192 0=0
Convolution              convrelu_76              1 1 185 193 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=32768 9=1
Concat                   cat_18                   2 1 192 193 194 0=0
Convolution              convrelu_77              1 1 194 195 0=256 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=65536 9=1
Convolution              convrelu_78              1 1 195 196 0=256 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=589824 9=1
Concat                   cat_19                   4 1 169 171 184 196 197 0=0
Convolution              convrelu_79              1 1 197 198 0=512 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=524288 9=1
Split                    splitncnn_26             1 2 198 199 200
Interp                   upsample_293             1 1 200 201 0=1 1=2.000000e+00 2=2.000000e+00 6=0
Concat                   cat_20                   2 1 201 72 202 0=0
Convolution              convrelu_80              1 1 202 203 0=256 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=262144 9=1
Slice                    chunk_8                  1 2 203 204 205 -23300=2,-233,-233 1=0
Split                    splitncnn_27             1 3 205 206 207 208
Convolution              convrelu_81              1 1 208 209 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=8192 9=1
Split                    splitncnn_28             1 2 209 210 211
Convolution              convrelu_82              1 1 211 212 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=36864 9=1
Convolution              convrelu_83              1 1 212 213 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=36864 9=1
BinaryOp                 add_10                   2 1 210 213 214 0=0
Convolution              convrelu_84              1 1 207 215 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=8192 9=1
Concat                   cat_21                   2 1 214 215 216 0=0
Convolution              convrelu_85              1 1 216 217 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=16384 9=1
Convolution              convrelu_86              1 1 217 218 0=128 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=147456 9=1
Split                    splitncnn_29             1 3 218 219 220 221
Convolution              convrelu_87              1 1 221 222 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=8192 9=1
Split                    splitncnn_30             1 2 222 223 224
Convolution              convrelu_88              1 1 224 225 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=36864 9=1
Convolution              convrelu_89              1 1 225 226 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=36864 9=1
BinaryOp                 add_11                   2 1 223 226 227 0=0
Convolution              convrelu_90              1 1 220 228 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=8192 9=1
Concat                   cat_22                   2 1 227 228 229 0=0
Convolution              convrelu_91              1 1 229 230 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=16384 9=1
Convolution              convrelu_92              1 1 230 231 0=128 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=147456 9=1
Concat                   cat_23                   4 1 204 206 219 231 232 0=0
Convolution              convrelu_93              1 1 232 233 0=256 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=131072 9=1
Split                    splitncnn_31             1 3 233 234 235 236
Pooling                  avgpool2d_3              1 1 234 237 0=1 1=2 11=2 12=1 13=0 2=1 3=0 5=1 6=1
Slice                    chunk_9                  1 2 237 238 239 -23300=2,-233,-233 1=0
Convolution              convrelu_94              1 1 238 240 0=128 1=3 11=3 12=1 13=2 14=1 2=1 3=2 4=1 5=1 6=147456 9=1
Pooling                  maxpool2d_8              1 1 239 241 0=0 1=3 11=3 12=2 13=1 2=2 3=1 5=1
Convolution              convrelu_95              1 1 241 242 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=16384 9=1
Concat                   cat_24                   2 1 240 242 243 0=0
Concat                   cat_25                   2 1 243 199 244 0=0
Convolution              convrelu_96              1 1 244 245 0=512 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=393216 9=1
Slice                    chunk_10                 1 2 245 246 247 -23300=2,-233,-233 1=0
Split                    splitncnn_32             1 3 247 248 249 250
Convolution              convrelu_97              1 1 250 251 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=32768 9=1
Split                    splitncnn_33             1 2 251 252 253
Convolution              convrelu_98              1 1 253 254 0=128 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=147456 9=1
Convolution              convrelu_99              1 1 254 255 0=128 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=147456 9=1
BinaryOp                 add_12                   2 1 252 255 256 0=0
Convolution              convrelu_100             1 1 249 257 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=32768 9=1
Concat                   cat_26                   2 1 256 257 258 0=0
Convolution              convrelu_101             1 1 258 259 0=256 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=65536 9=1
Convolution              convrelu_102             1 1 259 260 0=256 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=589824 9=1
Split                    splitncnn_34             1 3 260 261 262 263
Convolution              convrelu_103             1 1 263 264 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=32768 9=1
Split                    splitncnn_35             1 2 264 265 266
Convolution              convrelu_104             1 1 266 267 0=128 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=147456 9=1
Convolution              convrelu_105             1 1 267 268 0=128 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=147456 9=1
BinaryOp                 add_13                   2 1 265 268 269 0=0
Convolution              convrelu_106             1 1 262 270 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=32768 9=1
Concat                   cat_27                   2 1 269 270 271 0=0
Convolution              convrelu_107             1 1 271 272 0=256 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=65536 9=1
Convolution              convrelu_108             1 1 272 273 0=256 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=589824 9=1
Concat                   cat_28                   4 1 246 248 261 273 274 0=0
Convolution              convrelu_109             1 1 274 275 0=512 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=524288 9=1
Split                    splitncnn_36             1 3 275 276 277 278
Pooling                  avgpool2d_4              1 1 276 279 0=1 1=2 11=2 12=1 13=0 2=1 3=0 5=1 6=1
Slice                    chunk_11                 1 2 279 280 281 -23300=2,-233,-233 1=0
Convolution              convrelu_110             1 1 280 282 0=256 1=3 11=3 12=1 13=2 14=1 2=1 3=2 4=1 5=1 6=589824 9=1
Pooling                  maxpool2d_9              1 1 281 283 0=0 1=3 11=3 12=2 13=1 2=2 3=1 5=1
Convolution              convrelu_111             1 1 283 284 0=256 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=65536 9=1
Concat                   cat_29                   2 1 282 284 285 0=0
Concat                   cat_30                   2 1 285 164 286 0=0
Convolution              convrelu_112             1 1 286 287 0=512 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=524288 9=1
Slice                    chunk_12                 1 2 287 288 289 -23300=2,-233,-233 1=0
Split                    splitncnn_37             1 3 289 290 291 292
Convolution              convrelu_113             1 1 292 293 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=32768 9=1
Split                    splitncnn_38             1 2 293 294 295
Convolution              convrelu_114             1 1 295 296 0=128 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=147456 9=1
Convolution              convrelu_115             1 1 296 297 0=128 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=147456 9=1
BinaryOp                 add_14                   2 1 294 297 298 0=0
Convolution              convrelu_116             1 1 291 299 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=32768 9=1
Concat                   cat_31                   2 1 298 299 300 0=0
Convolution              convrelu_117             1 1 300 301 0=256 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=65536 9=1
Convolution              convrelu_118             1 1 301 302 0=256 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=589824 9=1
Split                    splitncnn_39             1 3 302 303 304 305
Convolution              convrelu_119             1 1 305 306 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=32768 9=1
Split                    splitncnn_40             1 2 306 307 308
Convolution              convrelu_120             1 1 308 309 0=128 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=147456 9=1
Convolution              convrelu_121             1 1 309 310 0=128 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=147456 9=1
BinaryOp                 add_15                   2 1 307 310 311 0=0
Convolution              convrelu_122             1 1 304 312 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=32768 9=1
Concat                   cat_32                   2 1 311 312 313 0=0
Convolution              convrelu_123             1 1 313 314 0=256 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=65536 9=1
Convolution              convrelu_124             1 1 314 315 0=256 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=589824 9=1
Concat                   cat_33                   4 1 288 290 303 315 316 0=0
Convolution              convrelu_125             1 1 316 317 0=512 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=524288 9=1
Split                    splitncnn_41             1 2 317 318 319
MemoryData               pnnx_321                 0 1 320 0=2100
Convolution              convrelu_126             1 1 236 321 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=147456 9=1
ConvolutionDepthWise     convdwrelu_0             1 1 321 322 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=9216 7=4 9=1
ConvolutionDepthWise     convdw_302               1 1 322 323 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=1024 7=4
Convolution              convrelu_127             1 1 235 324 0=256 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=589824 9=1
Convolution              convrelu_128             1 1 324 325 0=256 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=589824 9=1
Convolution              conv_141                 1 1 325 326 0=3 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=768
Concat                   cat_34                   2 1 323 326 327 0=0
Convolution              convrelu_129             1 1 278 328 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=294912 9=1
ConvolutionDepthWise     convdwrelu_1             1 1 328 329 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=9216 7=4 9=1
ConvolutionDepthWise     convdw_304               1 1 329 330 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=1024 7=4
Convolution              convrelu_130             1 1 277 331 0=256 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=1179648 9=1
Convolution              convrelu_131             1 1 331 332 0=256 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=589824 9=1
Convolution              conv_145                 1 1 332 333 0=3 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=768
Concat                   cat_35                   2 1 330 333 334 0=0
Convolution              convrelu_132             1 1 319 335 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=294912 9=1
ConvolutionDepthWise     convdwrelu_2             1 1 335 336 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=9216 7=4 9=1
ConvolutionDepthWise     convdw_306               1 1 336 337 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=1024 7=4
Convolution              convrelu_133             1 1 318 338 0=256 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=1179648 9=1
Convolution              convrelu_134             1 1 338 339 0=256 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=589824 9=1
Convolution              conv_149                 1 1 339 340 0=3 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=768
Concat                   cat_36                   2 1 337 340 341 0=0
Reshape                  view_295                 1 1 327 342 0=1600 1=67
Reshape                  view_296                 1 1 334 343 0=400 1=67
Reshape                  view_297                 1 1 341 344 0=100 1=67
Concat                   cat_37                   3 1 342 343 344 345 0=1
Slice                    split_0                  1 2 345 346 347 -23300=2,64,3 1=0
Reshape                  view_298                 1 1 346 348 0=2100 1=16 2=4
Permute                  transpose_300            1 1 348 349 0=2
Softmax                  softmax_11               1 1 349 350 0=0 1=1
Convolution              conv_150                 1 1 350 351 0=1 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=0 6=16
Reshape                  view_299                 1 1 351 352 0=2100 1=4
MemoryData               pnnx_fold_anchor_points.1 0 1 353 0=2100 1=2
MemoryData               pnnx_fold_anchor_points.1_1 0 1 354 0=2100 1=2
Slice                    split_1                  1 2 352 355 356 -23300=2,2,-233 1=0
BinaryOp                 sub_16                   2 1 353 355 357 0=1
Split                    splitncnn_42             1 2 357 358 359
BinaryOp                 add_17                   2 1 354 356 360 0=0
Split                    splitncnn_43             1 2 360 361 362
BinaryOp                 add_18                   2 1 358 361 363 0=0
BinaryOp                 div_19                   1 1 363 364 0=3 1=1 2=2.000000e+00
BinaryOp                 sub_20                   2 1 362 359 365 0=1
Concat                   cat_38                   2 1 364 365 366 0=0
Reshape                  reshape_294              1 1 320 367 0=2100 1=1
BinaryOp                 mul_21                   2 1 366 367 368 0=2
Sigmoid                  sigmoid_10               1 1 347 369
Concat                   cat_39                   2 1 368 369 out0 0=0
