7767517
44 48
Input                    in0                      0 1 in0
Convolution              convrelu_0               1 1 in0 1 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=1728 9=1
Convolution              convrelu_1               1 1 1 2 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=36864 9=1
Pooling                  maxpool2d_30             1 1 2 3 0=0 1=2 11=2 12=2 13=0 2=2 3=0 5=1
Convolution              convrelu_2               1 1 3 4 0=128 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=73728 9=1
Convolution              convrelu_3               1 1 4 5 0=128 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=147456 9=1
Split                    splitncnn_0              1 2 5 6 7
Pooling                  maxpool2d_31             1 1 7 8 0=0 1=2 11=2 12=2 13=0 2=2 3=0 5=1
Convolution              convrelu_4               1 1 8 9 0=256 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=294912 9=1
Convolution              convrelu_5               1 1 9 10 0=256 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=589824 9=1
Split                    splitncnn_1              1 2 10 11 12
Convolution              convrelu_6               1 1 12 13 0=256 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=589824 9=1
Pooling                  maxpool2d_32             1 1 13 14 0=0 1=2 11=2 12=2 13=0 2=2 3=0 5=1
Convolution              convrelu_7               1 1 14 15 0=512 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=1179648 9=1
Convolution              convrelu_8               1 1 15 16 0=512 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=2359296 9=1
Split                    splitncnn_2              1 2 16 17 18
Convolution              convrelu_9               1 1 18 19 0=512 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=2359296 9=1
Pooling                  maxpool2d_33             1 1 19 20 0=0 1=2 11=2 12=2 13=0 2=2 3=0 5=1
Convolution              convrelu_10              1 1 20 21 0=512 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=2359296 9=1
Convolution              conv_14                  1 1 21 22 0=512 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=2359296
Split                    splitncnn_3              1 2 22 23 24
Pooling                  maxpool2d_34             1 1 24 25 0=0 1=3 11=3 12=1 13=1 2=1 3=1 5=1
Convolution              conv_15                  1 1 25 26 0=1024 1=3 11=3 12=6 13=1 14=6 2=6 3=1 4=6 5=1 6=4718592
Convolution              conv_16                  1 1 26 27 0=1024 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=1048576
Concat                   cat_0                    2 1 27 23 28 0=0
Convolution              convrelu_11              1 1 28 29 0=512 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=786432 9=1
Convolution              convrelu_12              1 1 29 30 0=256 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=1179648 9=1
Interp                   upsample_0               1 1 30 31 0=2 3=80 4=80 6=0
Concat                   cat_1                    2 1 31 17 32 0=0
Convolution              convrelu_13              1 1 32 33 0=256 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=196608 9=1
Convolution              convrelu_14              1 1 33 34 0=128 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=294912 9=1
Interp                   upsample_1               1 1 34 35 0=2 3=160 4=160 6=0
Concat                   cat_2                    2 1 35 11 36 0=0
Convolution              convrelu_15              1 1 36 37 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=49152 9=1
Convolution              convrelu_16              1 1 37 38 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=73728 9=1
Interp                   upsample_2               1 1 38 39 0=2 3=320 4=320 6=0
Concat                   cat_3                    2 1 39 6 40 0=0
Convolution              convrelu_17              1 1 40 41 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=12288 9=1
Convolution              convrelu_18              1 1 41 42 0=32 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=18432 9=1
Convolution              convrelu_19              1 1 42 43 0=32 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=9216 9=1
Convolution              convrelu_20              1 1 43 44 0=32 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=9216 9=1
Convolution              convrelu_21              1 1 44 45 0=16 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=4608 9=1
Convolution              convrelu_22              1 1 45 46 0=16 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=256 9=1
Convolution              conv_29                  1 1 46 out0 0=2 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=32
