7767517
407 479
Input                    in0                      0 1 in0
Convolution              conv_7                   1 1 in0 1 0=32 1=3 11=3 12=1 13=2 14=1 2=1 3=2 4=1 5=1 6=864
Swish                    silu_144                 1 1 1 2
Convolution              conv_8                   1 1 2 3 0=64 1=3 11=3 12=1 13=2 14=1 2=1 3=2 4=1 5=1 6=18432
Swish                    silu_145                 1 1 3 4
Convolution              conv_9                   1 1 4 5 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=8192
Swish                    silu_146                 1 1 5 6
Slice                    chunk_0                  1 2 6 7 8 -23300=2,-233,-233 1=0
Split                    splitncnn_0              1 3 8 9 10 11
Convolution              conv_10                  1 1 11 12 0=32 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=2048
Swish                    silu_147                 1 1 12 13
Split                    splitncnn_1              1 2 13 14 15
Convolution              conv_11                  1 1 15 16 0=32 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=9216
Swish                    silu_148                 1 1 16 17
Convolution              conv_12                  1 1 17 18 0=32 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=9216
Swish                    silu_149                 1 1 18 19
BinaryOp                 add_0                    2 1 14 19 20 0=0
Convolution              conv_13                  1 1 10 21 0=32 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=2048
Swish                    silu_150                 1 1 21 22
Concat                   cat_0                    2 1 20 22 23 0=0
Convolution              conv_14                  1 1 23 24 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=4096
Swish                    silu_151                 1 1 24 25
Convolution              conv_15                  1 1 25 26 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=36864
Swish                    silu_152                 1 1 26 27
Split                    splitncnn_2              1 3 27 28 29 30
Convolution              conv_16                  1 1 30 31 0=32 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=2048
Swish                    silu_153                 1 1 31 32
Split                    splitncnn_3              1 2 32 33 34
Convolution              conv_17                  1 1 34 35 0=32 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=9216
Swish                    silu_154                 1 1 35 36
Convolution              conv_18                  1 1 36 37 0=32 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=9216
Swish                    silu_155                 1 1 37 38
BinaryOp                 add_1                    2 1 33 38 39 0=0
Convolution              conv_19                  1 1 29 40 0=32 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=2048
Swish                    silu_156                 1 1 40 41
Concat                   cat_1                    2 1 39 41 42 0=0
Convolution              conv_20                  1 1 42 43 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=4096
Swish                    silu_157                 1 1 43 44
Convolution              conv_21                  1 1 44 45 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=36864
Swish                    silu_158                 1 1 45 46
Concat                   cat_2                    4 1 7 9 28 46 47 0=0
Convolution              conv_22                  1 1 47 48 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=32768
Swish                    silu_159                 1 1 48 49
Pooling                  avgpool2d_0              1 1 49 50 0=1 1=2 11=2 12=1 13=0 2=1 3=0 5=1 6=1
Convolution              conv_23                  1 1 50 51 0=240 1=3 11=3 12=1 13=2 14=1 2=1 3=2 4=1 5=1 6=276480
Swish                    silu_160                 1 1 51 52
Convolution              conv_24                  1 1 52 53 0=240 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=57600
Swish                    silu_161                 1 1 53 54
Slice                    chunk_1                  1 2 54 55 56 -23300=2,-233,-233 1=0
Split                    splitncnn_4              1 3 56 57 58 59
Convolution              conv_25                  1 1 59 60 0=60 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=7200
Swish                    silu_162                 1 1 60 61
Split                    splitncnn_5              1 2 61 62 63
Convolution              conv_26                  1 1 63 64 0=60 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=32400
Swish                    silu_163                 1 1 64 65
Convolution              conv_27                  1 1 65 66 0=60 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=32400
Swish                    silu_164                 1 1 66 67
BinaryOp                 add_2                    2 1 62 67 68 0=0
Convolution              conv_28                  1 1 58 69 0=60 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=7200
Swish                    silu_165                 1 1 69 70
Concat                   cat_3                    2 1 68 70 71 0=0
Convolution              conv_29                  1 1 71 72 0=120 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=14400
Swish                    silu_166                 1 1 72 73
Convolution              conv_30                  1 1 73 74 0=120 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=129600
Swish                    silu_167                 1 1 74 75
Split                    splitncnn_6              1 3 75 76 77 78
Convolution              conv_31                  1 1 78 79 0=60 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=7200
Swish                    silu_168                 1 1 79 80
Split                    splitncnn_7              1 2 80 81 82
Convolution              conv_32                  1 1 82 83 0=60 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=32400
Swish                    silu_169                 1 1 83 84
Convolution              conv_33                  1 1 84 85 0=60 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=32400
Swish                    silu_170                 1 1 85 86
BinaryOp                 add_3                    2 1 81 86 87 0=0
Convolution              conv_34                  1 1 77 88 0=60 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=7200
Swish                    silu_171                 1 1 88 89
Concat                   cat_4                    2 1 87 89 90 0=0
Convolution              conv_35                  1 1 90 91 0=120 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=14400
Swish                    silu_172                 1 1 91 92
Convolution              conv_36                  1 1 92 93 0=120 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=129600
Swish                    silu_173                 1 1 93 94
Concat                   cat_5                    4 1 55 57 76 94 95 0=0
Convolution              conv_37                  1 1 95 96 0=240 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=115200
Swish                    silu_174                 1 1 96 97
Split                    splitncnn_8              1 2 97 98 99
Pooling                  avgpool2d_1              1 1 99 100 0=1 1=2 11=2 12=1 13=0 2=1 3=0 5=1 6=1
Convolution              conv_38                  1 1 100 101 0=360 1=3 11=3 12=1 13=2 14=1 2=1 3=2 4=1 5=1 6=777600
Swish                    silu_175                 1 1 101 102
Convolution              conv_39                  1 1 102 103 0=360 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=129600
Swish                    silu_176                 1 1 103 104
Slice                    chunk_2                  1 2 104 105 106 -23300=2,-233,-233 1=0
Split                    splitncnn_9              1 3 106 107 108 109
Convolution              conv_40                  1 1 109 110 0=90 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=16200
Swish                    silu_177                 1 1 110 111
Split                    splitncnn_10             1 2 111 112 113
Convolution              conv_41                  1 1 113 114 0=90 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=72900
Swish                    silu_178                 1 1 114 115
Convolution              conv_42                  1 1 115 116 0=90 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=72900
Swish                    silu_179                 1 1 116 117
BinaryOp                 add_4                    2 1 112 117 118 0=0
Convolution              conv_43                  1 1 108 119 0=90 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=16200
Swish                    silu_180                 1 1 119 120
Concat                   cat_6                    2 1 118 120 121 0=0
Convolution              conv_44                  1 1 121 122 0=180 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=32400
Swish                    silu_181                 1 1 122 123
Convolution              conv_45                  1 1 123 124 0=180 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=291600
Swish                    silu_182                 1 1 124 125
Split                    splitncnn_11             1 3 125 126 127 128
Convolution              conv_46                  1 1 128 129 0=90 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=16200
Swish                    silu_183                 1 1 129 130
Split                    splitncnn_12             1 2 130 131 132
Convolution              conv_47                  1 1 132 133 0=90 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=72900
Swish                    silu_184                 1 1 133 134
Convolution              conv_48                  1 1 134 135 0=90 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=72900
Swish                    silu_185                 1 1 135 136
BinaryOp                 add_5                    2 1 131 136 137 0=0
Convolution              conv_49                  1 1 127 138 0=90 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=16200
Swish                    silu_186                 1 1 138 139
Concat                   cat_7                    2 1 137 139 140 0=0
Convolution              conv_50                  1 1 140 141 0=180 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=32400
Swish                    silu_187                 1 1 141 142
Convolution              conv_51                  1 1 142 143 0=180 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=291600
Swish                    silu_188                 1 1 143 144
Concat                   cat_8                    4 1 105 107 126 144 145 0=0
Convolution              conv_52                  1 1 145 146 0=360 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=259200
Swish                    silu_189                 1 1 146 147
Split                    splitncnn_13             1 2 147 148 149
Pooling                  avgpool2d_2              1 1 149 150 0=1 1=2 11=2 12=1 13=0 2=1 3=0 5=1 6=1
Convolution              conv_53                  1 1 150 151 0=480 1=3 11=3 12=1 13=2 14=1 2=1 3=2 4=1 5=1 6=1555200
Swish                    silu_190                 1 1 151 152
Convolution              conv_54                  1 1 152 153 0=480 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=230400
Swish                    silu_191                 1 1 153 154
Slice                    chunk_3                  1 2 154 155 156 -23300=2,-233,-233 1=0
Split                    splitncnn_14             1 3 156 157 158 159
Convolution              conv_55                  1 1 159 160 0=120 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=28800
Swish                    silu_192                 1 1 160 161
Split                    splitncnn_15             1 2 161 162 163
Convolution              conv_56                  1 1 163 164 0=120 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=129600
Swish                    silu_193                 1 1 164 165
Convolution              conv_57                  1 1 165 166 0=120 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=129600
Swish                    silu_194                 1 1 166 167
BinaryOp                 add_6                    2 1 162 167 168 0=0
Convolution              conv_58                  1 1 158 169 0=120 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=28800
Swish                    silu_195                 1 1 169 170
Concat                   cat_9                    2 1 168 170 171 0=0
Convolution              conv_59                  1 1 171 172 0=240 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=57600
Swish                    silu_196                 1 1 172 173
Convolution              conv_60                  1 1 173 174 0=240 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=518400
Swish                    silu_197                 1 1 174 175
Split                    splitncnn_16             1 3 175 176 177 178
Convolution              conv_61                  1 1 178 179 0=120 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=28800
Swish                    silu_198                 1 1 179 180
Split                    splitncnn_17             1 2 180 181 182
Convolution              conv_62                  1 1 182 183 0=120 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=129600
Swish                    silu_199                 1 1 183 184
Convolution              conv_63                  1 1 184 185 0=120 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=129600
Swish                    silu_200                 1 1 185 186
BinaryOp                 add_7                    2 1 181 186 187 0=0
Convolution              conv_64                  1 1 177 188 0=120 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=28800
Swish                    silu_201                 1 1 188 189
Concat                   cat_10                   2 1 187 189 190 0=0
Convolution              conv_65                  1 1 190 191 0=240 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=57600
Swish                    silu_202                 1 1 191 192
Convolution              conv_66                  1 1 192 193 0=240 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=518400
Swish                    silu_203                 1 1 193 194
Concat                   cat_11                   4 1 155 157 176 194 195 0=0
Convolution              conv_67                  1 1 195 196 0=480 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=460800
Swish                    silu_204                 1 1 196 197
Convolution              conv_68                  1 1 197 198 0=240 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=115200
Swish                    silu_205                 1 1 198 199
Split                    splitncnn_18             1 2 199 200 201
Pooling                  maxpool2d_141            1 1 201 202 0=0 1=5 11=5 12=1 13=2 2=1 3=2 5=1
Split                    splitncnn_19             1 2 202 203 204
Pooling                  maxpool2d_142            1 1 204 205 0=0 1=5 11=5 12=1 13=2 2=1 3=2 5=1
Split                    splitncnn_20             1 2 205 206 207
Pooling                  maxpool2d_143            1 1 207 208 0=0 1=5 11=5 12=1 13=2 2=1 3=2 5=1
Concat                   cat_12                   4 1 200 203 206 208 209 0=0
Convolution              conv_69                  1 1 209 210 0=480 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=460800
Swish                    silu_206                 1 1 210 211
Split                    splitncnn_21             1 2 211 212 213
Interp                   upsample_277             1 1 213 214 0=1 1=2.000000e+00 2=2.000000e+00 6=0
Concat                   cat_13                   2 1 214 148 215 0=0
Convolution              conv_70                  1 1 215 216 0=360 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=302400
Swish                    silu_207                 1 1 216 217
Slice                    chunk_4                  1 2 217 218 219 -23300=2,-233,-233 1=0
Split                    splitncnn_22             1 3 219 220 221 222
Convolution              conv_71                  1 1 222 223 0=90 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=16200
Swish                    silu_208                 1 1 223 224
Split                    splitncnn_23             1 2 224 225 226
Convolution              conv_72                  1 1 226 227 0=90 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=72900
Swish                    silu_209                 1 1 227 228
Convolution              conv_73                  1 1 228 229 0=90 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=72900
Swish                    silu_210                 1 1 229 230
BinaryOp                 add_8                    2 1 225 230 231 0=0
Convolution              conv_74                  1 1 221 232 0=90 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=16200
Swish                    silu_211                 1 1 232 233
Concat                   cat_14                   2 1 231 233 234 0=0
Convolution              conv_75                  1 1 234 235 0=180 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=32400
Swish                    silu_212                 1 1 235 236
Convolution              conv_76                  1 1 236 237 0=180 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=291600
Swish                    silu_213                 1 1 237 238
Split                    splitncnn_24             1 3 238 239 240 241
Convolution              conv_77                  1 1 241 242 0=90 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=16200
Swish                    silu_214                 1 1 242 243
Split                    splitncnn_25             1 2 243 244 245
Convolution              conv_78                  1 1 245 246 0=90 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=72900
Swish                    silu_215                 1 1 246 247
Convolution              conv_79                  1 1 247 248 0=90 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=72900
Swish                    silu_216                 1 1 248 249
BinaryOp                 add_9                    2 1 244 249 250 0=0
Convolution              conv_80                  1 1 240 251 0=90 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=16200
Swish                    silu_217                 1 1 251 252
Concat                   cat_15                   2 1 250 252 253 0=0
Convolution              conv_81                  1 1 253 254 0=180 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=32400
Swish                    silu_218                 1 1 254 255
Convolution              conv_82                  1 1 255 256 0=180 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=291600
Swish                    silu_219                 1 1 256 257
Concat                   cat_16                   4 1 218 220 239 257 258 0=0
Convolution              conv_83                  1 1 258 259 0=360 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=259200
Swish                    silu_220                 1 1 259 260
Split                    splitncnn_26             1 2 260 261 262
Interp                   upsample_278             1 1 262 263 0=1 1=2.000000e+00 2=2.000000e+00 6=0
Concat                   cat_17                   2 1 263 98 264 0=0
Convolution              conv_84                  1 1 264 265 0=240 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=144000
Swish                    silu_221                 1 1 265 266
Slice                    chunk_5                  1 2 266 267 268 -23300=2,-233,-233 1=0
Split                    splitncnn_27             1 3 268 269 270 271
Convolution              conv_85                  1 1 271 272 0=60 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=7200
Swish                    silu_222                 1 1 272 273
Split                    splitncnn_28             1 2 273 274 275
Convolution              conv_86                  1 1 275 276 0=60 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=32400
Swish                    silu_223                 1 1 276 277
Convolution              conv_87                  1 1 277 278 0=60 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=32400
Swish                    silu_224                 1 1 278 279
BinaryOp                 add_10                   2 1 274 279 280 0=0
Convolution              conv_88                  1 1 270 281 0=60 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=7200
Swish                    silu_225                 1 1 281 282
Concat                   cat_18                   2 1 280 282 283 0=0
Convolution              conv_89                  1 1 283 284 0=120 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=14400
Swish                    silu_226                 1 1 284 285
Convolution              conv_90                  1 1 285 286 0=120 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=129600
Swish                    silu_227                 1 1 286 287
Split                    splitncnn_29             1 3 287 288 289 290
Convolution              conv_91                  1 1 290 291 0=60 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=7200
Swish                    silu_228                 1 1 291 292
Split                    splitncnn_30             1 2 292 293 294
Convolution              conv_92                  1 1 294 295 0=60 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=32400
Swish                    silu_229                 1 1 295 296
Convolution              conv_93                  1 1 296 297 0=60 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=32400
Swish                    silu_230                 1 1 297 298
BinaryOp                 add_11                   2 1 293 298 299 0=0
Convolution              conv_94                  1 1 289 300 0=60 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=7200
Swish                    silu_231                 1 1 300 301
Concat                   cat_19                   2 1 299 301 302 0=0
Convolution              conv_95                  1 1 302 303 0=120 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=14400
Swish                    silu_232                 1 1 303 304
Convolution              conv_96                  1 1 304 305 0=120 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=129600
Swish                    silu_233                 1 1 305 306
Concat                   cat_20                   4 1 267 269 288 306 307 0=0
Convolution              conv_97                  1 1 307 308 0=240 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=115200
Swish                    silu_234                 1 1 308 309
Split                    splitncnn_31             1 3 309 310 311 312
Pooling                  avgpool2d_3              1 1 310 313 0=1 1=2 11=2 12=1 13=0 2=1 3=0 5=1 6=1
Convolution              conv_98                  1 1 313 314 0=184 1=3 11=3 12=1 13=2 14=1 2=1 3=2 4=1 5=1 6=397440
Swish                    silu_235                 1 1 314 315
Concat                   cat_21                   2 1 315 261 316 0=0
Convolution              conv_99                  1 1 316 317 0=360 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=195840
Swish                    silu_236                 1 1 317 318
Slice                    chunk_6                  1 2 318 319 320 -23300=2,-233,-233 1=0
Split                    splitncnn_32             1 3 320 321 322 323
Convolution              conv_100                 1 1 323 324 0=90 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=16200
Swish                    silu_237                 1 1 324 325
Split                    splitncnn_33             1 2 325 326 327
Convolution              conv_101                 1 1 327 328 0=90 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=72900
Swish                    silu_238                 1 1 328 329
Convolution              conv_102                 1 1 329 330 0=90 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=72900
Swish                    silu_239                 1 1 330 331
BinaryOp                 add_12                   2 1 326 331 332 0=0
Convolution              conv_103                 1 1 322 333 0=90 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=16200
Swish                    silu_240                 1 1 333 334
Concat                   cat_22                   2 1 332 334 335 0=0
Convolution              conv_104                 1 1 335 336 0=180 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=32400
Swish                    silu_241                 1 1 336 337
Convolution              conv_105                 1 1 337 338 0=180 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=291600
Swish                    silu_242                 1 1 338 339
Split                    splitncnn_34             1 3 339 340 341 342
Convolution              conv_106                 1 1 342 343 0=90 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=16200
Swish                    silu_243                 1 1 343 344
Split                    splitncnn_35             1 2 344 345 346
Convolution              conv_107                 1 1 346 347 0=90 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=72900
Swish                    silu_244                 1 1 347 348
Convolution              conv_108                 1 1 348 349 0=90 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=72900
Swish                    silu_245                 1 1 349 350
BinaryOp                 add_13                   2 1 345 350 351 0=0
Convolution              conv_109                 1 1 341 352 0=90 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=16200
Swish                    silu_246                 1 1 352 353
Concat                   cat_23                   2 1 351 353 354 0=0
Convolution              conv_110                 1 1 354 355 0=180 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=32400
Swish                    silu_247                 1 1 355 356
Convolution              conv_111                 1 1 356 357 0=180 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=291600
Swish                    silu_248                 1 1 357 358
Concat                   cat_24                   4 1 319 321 340 358 359 0=0
Convolution              conv_112                 1 1 359 360 0=360 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=259200
Swish                    silu_249                 1 1 360 361
Split                    splitncnn_36             1 3 361 362 363 364
Pooling                  avgpool2d_4              1 1 362 365 0=1 1=2 11=2 12=1 13=0 2=1 3=0 5=1 6=1
Convolution              conv_113                 1 1 365 366 0=240 1=3 11=3 12=1 13=2 14=1 2=1 3=2 4=1 5=1 6=777600
Swish                    silu_250                 1 1 366 367
Concat                   cat_25                   2 1 367 212 368 0=0
Convolution              conv_114                 1 1 368 369 0=480 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=345600
Swish                    silu_251                 1 1 369 370
Slice                    chunk_7                  1 2 370 371 372 -23300=2,-233,-233 1=0
Split                    splitncnn_37             1 3 372 373 374 375
Convolution              conv_115                 1 1 375 376 0=120 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=28800
Swish                    silu_252                 1 1 376 377
Split                    splitncnn_38             1 2 377 378 379
Convolution              conv_116                 1 1 379 380 0=120 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=129600
Swish                    silu_253                 1 1 380 381
Convolution              conv_117                 1 1 381 382 0=120 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=129600
Swish                    silu_254                 1 1 382 383
BinaryOp                 add_14                   2 1 378 383 384 0=0
Convolution              conv_118                 1 1 374 385 0=120 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=28800
Swish                    silu_255                 1 1 385 386
Concat                   cat_26                   2 1 384 386 387 0=0
Convolution              conv_119                 1 1 387 388 0=240 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=57600
Swish                    silu_256                 1 1 388 389
Convolution              conv_120                 1 1 389 390 0=240 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=518400
Swish                    silu_257                 1 1 390 391
Split                    splitncnn_39             1 3 391 392 393 394
Convolution              conv_121                 1 1 394 395 0=120 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=28800
Swish                    silu_258                 1 1 395 396
Split                    splitncnn_40             1 2 396 397 398
Convolution              conv_122                 1 1 398 399 0=120 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=129600
Swish                    silu_259                 1 1 399 400
Convolution              conv_123                 1 1 400 401 0=120 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=129600
Swish                    silu_260                 1 1 401 402
BinaryOp                 add_15                   2 1 397 402 403 0=0
Convolution              conv_124                 1 1 393 404 0=120 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=28800
Swish                    silu_261                 1 1 404 405
Concat                   cat_27                   2 1 403 405 406 0=0
Convolution              conv_125                 1 1 406 407 0=240 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=57600
Swish                    silu_262                 1 1 407 408
Convolution              conv_126                 1 1 408 409 0=240 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=518400
Swish                    silu_263                 1 1 409 410
Concat                   cat_28                   4 1 371 373 392 410 411 0=0
Convolution              conv_127                 1 1 411 412 0=480 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=460800
Swish                    silu_264                 1 1 412 413
Split                    splitncnn_41             1 2 413 414 415
MemoryData               pnnx_216                 0 1 416 0=2100
Convolution              conv_128                 1 1 312 417 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=138240
Swish                    silu_265                 1 1 417 418
ConvolutionDepthWise     convdw_286               1 1 418 419 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=9216 7=4
Swish                    silu_266                 1 1 419 420
ConvolutionDepthWise     convdw_287               1 1 420 421 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=1024 7=4
Convolution              conv_129                 1 1 311 422 0=240 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=518400
Swish                    silu_267                 1 1 422 423
Convolution              conv_130                 1 1 423 424 0=240 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=518400
Swish                    silu_268                 1 1 424 425
Convolution              conv_131                 1 1 425 426 0=3 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=720
Concat                   cat_29                   2 1 421 426 427 0=0
Convolution              conv_132                 1 1 364 428 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=207360
Swish                    silu_269                 1 1 428 429
ConvolutionDepthWise     convdw_288               1 1 429 430 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=9216 7=4
Swish                    silu_270                 1 1 430 431
ConvolutionDepthWise     convdw_289               1 1 431 432 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=1024 7=4
Convolution              conv_133                 1 1 363 433 0=240 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=777600
Swish                    silu_271                 1 1 433 434
Convolution              conv_134                 1 1 434 435 0=240 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=518400
Swish                    silu_272                 1 1 435 436
Convolution              conv_135                 1 1 436 437 0=3 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=720
Concat                   cat_30                   2 1 432 437 438 0=0
Convolution              conv_136                 1 1 415 439 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=276480
Swish                    silu_273                 1 1 439 440
ConvolutionDepthWise     convdw_290               1 1 440 441 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=9216 7=4
Swish                    silu_274                 1 1 441 442
ConvolutionDepthWise     convdw_291               1 1 442 443 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=1024 7=4
Convolution              conv_137                 1 1 414 444 0=240 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=1036800
Swish                    silu_275                 1 1 444 445
Convolution              conv_138                 1 1 445 446 0=240 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=518400
Swish                    silu_276                 1 1 446 447
Convolution              conv_139                 1 1 447 448 0=3 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=720
Concat                   cat_31                   2 1 443 448 449 0=0
Reshape                  view_280                 1 1 427 450 0=1600 1=67
Reshape                  view_281                 1 1 438 451 0=400 1=67
Reshape                  view_282                 1 1 449 452 0=100 1=67
Concat                   cat_32                   3 1 450 451 452 453 0=1
Slice                    split_0                  1 2 453 454 455 -23300=2,64,3 1=0
Reshape                  view_283                 1 1 454 456 0=2100 1=16 2=4
Permute                  transpose_285            1 1 456 457 0=2
Softmax                  softmax_6                1 1 457 458 0=0 1=1
Convolution              conv_140                 1 1 458 459 0=1 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=0 6=16
Reshape                  view_284                 1 1 459 460 0=2100 1=4
MemoryData               pnnx_fold_anchor_points.1 0 1 461 0=2100 1=2
MemoryData               pnnx_fold_anchor_points.1_1 0 1 462 0=2100 1=2
Slice                    split_1                  1 2 460 463 464 -23300=2,2,-233 1=0
BinaryOp                 sub_16                   2 1 461 463 465 0=1
Split                    splitncnn_42             1 2 465 466 467
BinaryOp                 add_17                   2 1 462 464 468 0=0
Split                    splitncnn_43             1 2 468 469 470
BinaryOp                 add_18                   2 1 466 469 471 0=0
BinaryOp                 div_19                   1 1 471 472 0=3 1=1 2=2.000000e+00
BinaryOp                 sub_20                   2 1 470 467 473 0=1
Concat                   cat_33                   2 1 472 473 474 0=0
Reshape                  reshape_279              1 1 416 475 0=2100 1=1
BinaryOp                 mul_21                   2 1 474 475 476 0=2
Sigmoid                  sigmoid_5                1 1 455 477
Concat                   cat_34                   2 1 476 477 out0 0=0
