7767517
20 20
Input                    in0                      0 1 in0
Convolution              convrelu_0               1 1 in0 1 0=32 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=288 9=1
Pooling                  maxpool2d_12             1 1 1 2 0=0 1=2 11=2 12=2 13=0 2=2 3=0 5=1
Convolution              convrelu_1               1 1 2 3 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=18432 9=1
Pooling                  maxpool2d_13             1 1 3 4 0=0 1=2 11=2 12=2 13=0 2=2 3=0 5=1
Convolution              convrelu_2               1 1 4 5 0=128 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=73728 9=1
Convolution              convrelu_3               1 1 5 6 0=128 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=147456 9=1
Pooling                  maxpool2d_14             1 1 6 7 0=0 1=1 11=2 12=2 13=0 2=1 3=0 5=1
Convolution              convrelu_4               1 1 7 8 0=256 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=294912 9=1
Convolution              convrelu_5               1 1 8 9 0=256 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=589824 9=1
Pooling                  maxpool2d_15             1 1 9 10 0=0 1=1 11=2 12=2 13=0 2=1 3=0 5=1
Convolution              convrelu_6               1 1 10 11 0=256 1=2 11=2 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=262144 9=1
Permute                  permute_24               1 1 11 12 0=4
Pooling                  aap_26                   1 1 12 13 0=1 18=-233 7=1 8=1
Squeeze                  squeeze_25               1 1 13 14 -23303=1,2
LSTM                     lstm_10                  1 1 14 15 0=256 1=524288 2=2 3=256
Gemm                     gemm_0                   1 1 15 16 10=4 2=0 3=1 4=0 5=1 6=1 7=95 8=256 9=512
LSTM                     lstm_11                  1 1 16 17 0=256 1=524288 2=2 3=256
Gemm                     gemm_1                   1 1 17 18 10=4 2=0 3=1 4=0 5=1 6=1 7=95 8=256 9=512
Gemm                     gemm_2                   1 1 18 out0 10=4 2=0 3=1 4=0 5=1 6=1 7=95 8=97 9=256
