7767517
247 299
Input                    in0                      0 1 in0
Convolution              convrelu_0               1 1 in0 1 0=32 1=3 11=3 12=1 13=2 14=0 2=1 3=2 4=0 5=1 6=864 9=1
Convolution              convrelu_1               1 1 1 2 0=32 1=3 11=3 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=9216 9=1
Convolution              convrelu_2               1 1 2 3 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=18432 9=1
Pooling                  maxpool2d_135            1 1 3 4 0=0 1=3 11=3 12=2 13=0 2=2 3=0 5=1
Convolution              convrelu_3               1 1 4 5 0=80 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=5120 9=1
Convolution              convrelu_4               1 1 5 6 0=192 1=3 11=3 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=138240 9=1
Convolution              convrelu_5               1 1 6 7 0=256 1=3 11=3 12=1 13=2 14=0 2=1 3=2 4=0 5=1 6=442368 9=1
Split                    splitncnn_0              1 4 7 8 9 10 11
Convolution              convrelu_6               1 1 11 12 0=32 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=8192 9=1
Convolution              convrelu_7               1 1 10 13 0=32 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=8192 9=1
Convolution              convrelu_8               1 1 13 14 0=32 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=9216 9=1
Convolution              convrelu_9               1 1 9 15 0=32 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=8192 9=1
Convolution              convrelu_10              1 1 15 16 0=32 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=9216 9=1
Convolution              convrelu_11              1 1 16 17 0=32 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=9216 9=1
Concat                   cat_0                    3 1 12 14 17 18 0=0
Convolution              conv_14                  1 1 18 19 0=256 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=24576
BinaryOp                 mul_0                    1 1 19 20 0=2 1=1 2=1.700000e-01
BinaryOp                 add_1                    2 1 20 8 21 0=0
ReLU                     relu_150                 1 1 21 22
Split                    splitncnn_1              1 4 22 23 24 25 26
Convolution              convrelu_12              1 1 26 27 0=32 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=8192 9=1
Convolution              convrelu_13              1 1 25 28 0=32 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=8192 9=1
Convolution              convrelu_14              1 1 28 29 0=32 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=9216 9=1
Convolution              convrelu_15              1 1 24 30 0=32 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=8192 9=1
Convolution              convrelu_16              1 1 30 31 0=32 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=9216 9=1
Convolution              convrelu_17              1 1 31 32 0=32 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=9216 9=1
Concat                   cat_1                    3 1 27 29 32 33 0=0
Convolution              conv_21                  1 1 33 34 0=256 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=24576
BinaryOp                 mul_2                    1 1 34 35 0=2 1=1 2=1.700000e-01
BinaryOp                 add_3                    2 1 35 23 36 0=0
ReLU                     relu_157                 1 1 36 37
Split                    splitncnn_2              1 4 37 38 39 40 41
Convolution              convrelu_18              1 1 41 42 0=32 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=8192 9=1
Convolution              convrelu_19              1 1 40 43 0=32 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=8192 9=1
Convolution              convrelu_20              1 1 43 44 0=32 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=9216 9=1
Convolution              convrelu_21              1 1 39 45 0=32 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=8192 9=1
Convolution              convrelu_22              1 1 45 46 0=32 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=9216 9=1
Convolution              convrelu_23              1 1 46 47 0=32 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=9216 9=1
Concat                   cat_2                    3 1 42 44 47 48 0=0
Convolution              conv_28                  1 1 48 49 0=256 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=24576
BinaryOp                 mul_4                    1 1 49 50 0=2 1=1 2=1.700000e-01
BinaryOp                 add_5                    2 1 50 38 51 0=0
ReLU                     relu_164                 1 1 51 52
Split                    splitncnn_3              1 4 52 53 54 55 56
Convolution              convrelu_24              1 1 56 57 0=32 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=8192 9=1
Convolution              convrelu_25              1 1 55 58 0=32 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=8192 9=1
Convolution              convrelu_26              1 1 58 59 0=32 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=9216 9=1
Convolution              convrelu_27              1 1 54 60 0=32 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=8192 9=1
Convolution              convrelu_28              1 1 60 61 0=32 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=9216 9=1
Convolution              convrelu_29              1 1 61 62 0=32 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=9216 9=1
Concat                   cat_3                    3 1 57 59 62 63 0=0
Convolution              conv_35                  1 1 63 64 0=256 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=24576
BinaryOp                 mul_6                    1 1 64 65 0=2 1=1 2=1.700000e-01
BinaryOp                 add_7                    2 1 65 53 66 0=0
ReLU                     relu_171                 1 1 66 67
Split                    splitncnn_4              1 4 67 68 69 70 71
Convolution              convrelu_30              1 1 71 72 0=32 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=8192 9=1
Convolution              convrelu_31              1 1 70 73 0=32 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=8192 9=1
Convolution              convrelu_32              1 1 73 74 0=32 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=9216 9=1
Convolution              convrelu_33              1 1 69 75 0=32 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=8192 9=1
Convolution              convrelu_34              1 1 75 76 0=32 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=9216 9=1
Convolution              convrelu_35              1 1 76 77 0=32 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=9216 9=1
Concat                   cat_4                    3 1 72 74 77 78 0=0
Convolution              conv_42                  1 1 78 79 0=256 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=24576
BinaryOp                 mul_8                    1 1 79 80 0=2 1=1 2=1.700000e-01
BinaryOp                 add_9                    2 1 80 68 81 0=0
ReLU                     relu_178                 1 1 81 82
Split                    splitncnn_5              1 3 82 83 84 85
Convolution              convrelu_36              1 1 84 86 0=384 1=3 11=3 12=1 13=2 14=0 2=1 3=2 4=0 5=1 6=884736 9=1
Convolution              convrelu_37              1 1 83 87 0=192 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=49152 9=1
Convolution              convrelu_38              1 1 87 88 0=192 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=331776 9=1
Convolution              convrelu_39              1 1 88 89 0=256 1=3 11=3 12=1 13=2 14=0 2=1 3=2 4=0 5=1 6=442368 9=1
Pooling                  maxpool2d_136            1 1 85 90 0=0 1=3 11=3 12=2 13=0 2=2 3=0 5=1
Concat                   cat_5                    3 1 86 89 90 91 0=0
Split                    splitncnn_6              1 3 91 92 93 94
Convolution              convrelu_40              1 1 94 95 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=114688 9=1
Convolution              convrelu_41              1 1 93 96 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=114688 9=1
Convolution              convrelu_42              1 1 96 97 0=128 1=7 11=1 12=1 13=1 14=0 2=1 3=1 4=3 5=1 6=114688 9=1
Convolution              convrelu_43              1 1 97 98 0=128 1=1 11=7 12=1 13=1 14=3 2=1 3=1 4=0 5=1 6=114688 9=1
Concat                   cat_6                    2 1 95 98 99 0=0
Convolution              conv_51                  1 1 99 100 0=896 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=229376
BinaryOp                 mul_10                   1 1 100 101 0=2 1=1 2=1.000000e-01
BinaryOp                 add_11                   2 1 101 92 102 0=0
ReLU                     relu_187                 1 1 102 103
Split                    splitncnn_7              1 3 103 104 105 106
Convolution              convrelu_44              1 1 106 107 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=114688 9=1
Convolution              convrelu_45              1 1 105 108 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=114688 9=1
Convolution              convrelu_46              1 1 108 109 0=128 1=7 11=1 12=1 13=1 14=0 2=1 3=1 4=3 5=1 6=114688 9=1
Convolution              convrelu_47              1 1 109 110 0=128 1=1 11=7 12=1 13=1 14=3 2=1 3=1 4=0 5=1 6=114688 9=1
Concat                   cat_7                    2 1 107 110 111 0=0
Convolution              conv_56                  1 1 111 112 0=896 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=229376
BinaryOp                 mul_12                   1 1 112 113 0=2 1=1 2=1.000000e-01
BinaryOp                 add_13                   2 1 113 104 114 0=0
ReLU                     relu_192                 1 1 114 115
Split                    splitncnn_8              1 3 115 116 117 118
Convolution              convrelu_48              1 1 118 119 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=114688 9=1
Convolution              convrelu_49              1 1 117 120 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=114688 9=1
Convolution              convrelu_50              1 1 120 121 0=128 1=7 11=1 12=1 13=1 14=0 2=1 3=1 4=3 5=1 6=114688 9=1
Convolution              convrelu_51              1 1 121 122 0=128 1=1 11=7 12=1 13=1 14=3 2=1 3=1 4=0 5=1 6=114688 9=1
Concat                   cat_8                    2 1 119 122 123 0=0
Convolution              conv_61                  1 1 123 124 0=896 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=229376
BinaryOp                 mul_14                   1 1 124 125 0=2 1=1 2=1.000000e-01
BinaryOp                 add_15                   2 1 125 116 126 0=0
ReLU                     relu_197                 1 1 126 127
Split                    splitncnn_9              1 3 127 128 129 130
Convolution              convrelu_52              1 1 130 131 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=114688 9=1
Convolution              convrelu_53              1 1 129 132 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=114688 9=1
Convolution              convrelu_54              1 1 132 133 0=128 1=7 11=1 12=1 13=1 14=0 2=1 3=1 4=3 5=1 6=114688 9=1
Convolution              convrelu_55              1 1 133 134 0=128 1=1 11=7 12=1 13=1 14=3 2=1 3=1 4=0 5=1 6=114688 9=1
Concat                   cat_9                    2 1 131 134 135 0=0
Convolution              conv_66                  1 1 135 136 0=896 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=229376
BinaryOp                 mul_16                   1 1 136 137 0=2 1=1 2=1.000000e-01
BinaryOp                 add_17                   2 1 137 128 138 0=0
ReLU                     relu_202                 1 1 138 139
Split                    splitncnn_10             1 3 139 140 141 142
Convolution              convrelu_56              1 1 142 143 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=114688 9=1
Convolution              convrelu_57              1 1 141 144 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=114688 9=1
Convolution              convrelu_58              1 1 144 145 0=128 1=7 11=1 12=1 13=1 14=0 2=1 3=1 4=3 5=1 6=114688 9=1
Convolution              convrelu_59              1 1 145 146 0=128 1=1 11=7 12=1 13=1 14=3 2=1 3=1 4=0 5=1 6=114688 9=1
Concat                   cat_10                   2 1 143 146 147 0=0
Convolution              conv_71                  1 1 147 148 0=896 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=229376
BinaryOp                 mul_18                   1 1 148 149 0=2 1=1 2=1.000000e-01
BinaryOp                 add_19                   2 1 149 140 150 0=0
ReLU                     relu_207                 1 1 150 151
Split                    splitncnn_11             1 3 151 152 153 154
Convolution              convrelu_60              1 1 154 155 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=114688 9=1
Convolution              convrelu_61              1 1 153 156 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=114688 9=1
Convolution              convrelu_62              1 1 156 157 0=128 1=7 11=1 12=1 13=1 14=0 2=1 3=1 4=3 5=1 6=114688 9=1
Convolution              convrelu_63              1 1 157 158 0=128 1=1 11=7 12=1 13=1 14=3 2=1 3=1 4=0 5=1 6=114688 9=1
Concat                   cat_11                   2 1 155 158 159 0=0
Convolution              conv_76                  1 1 159 160 0=896 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=229376
BinaryOp                 mul_20                   1 1 160 161 0=2 1=1 2=1.000000e-01
BinaryOp                 add_21                   2 1 161 152 162 0=0
ReLU                     relu_212                 1 1 162 163
Split                    splitncnn_12             1 3 163 164 165 166
Convolution              convrelu_64              1 1 166 167 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=114688 9=1
Convolution              convrelu_65              1 1 165 168 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=114688 9=1
Convolution              convrelu_66              1 1 168 169 0=128 1=7 11=1 12=1 13=1 14=0 2=1 3=1 4=3 5=1 6=114688 9=1
Convolution              convrelu_67              1 1 169 170 0=128 1=1 11=7 12=1 13=1 14=3 2=1 3=1 4=0 5=1 6=114688 9=1
Concat                   cat_12                   2 1 167 170 171 0=0
Convolution              conv_81                  1 1 171 172 0=896 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=229376
BinaryOp                 mul_22                   1 1 172 173 0=2 1=1 2=1.000000e-01
BinaryOp                 add_23                   2 1 173 164 174 0=0
ReLU                     relu_217                 1 1 174 175
Split                    splitncnn_13             1 3 175 176 177 178
Convolution              convrelu_68              1 1 178 179 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=114688 9=1
Convolution              convrelu_69              1 1 177 180 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=114688 9=1
Convolution              convrelu_70              1 1 180 181 0=128 1=7 11=1 12=1 13=1 14=0 2=1 3=1 4=3 5=1 6=114688 9=1
Convolution              convrelu_71              1 1 181 182 0=128 1=1 11=7 12=1 13=1 14=3 2=1 3=1 4=0 5=1 6=114688 9=1
Concat                   cat_13                   2 1 179 182 183 0=0
Convolution              conv_86                  1 1 183 184 0=896 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=229376
BinaryOp                 mul_24                   1 1 184 185 0=2 1=1 2=1.000000e-01
BinaryOp                 add_25                   2 1 185 176 186 0=0
ReLU                     relu_222                 1 1 186 187
Split                    splitncnn_14             1 3 187 188 189 190
Convolution              convrelu_72              1 1 190 191 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=114688 9=1
Convolution              convrelu_73              1 1 189 192 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=114688 9=1
Convolution              convrelu_74              1 1 192 193 0=128 1=7 11=1 12=1 13=1 14=0 2=1 3=1 4=3 5=1 6=114688 9=1
Convolution              convrelu_75              1 1 193 194 0=128 1=1 11=7 12=1 13=1 14=3 2=1 3=1 4=0 5=1 6=114688 9=1
Concat                   cat_14                   2 1 191 194 195 0=0
Convolution              conv_91                  1 1 195 196 0=896 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=229376
BinaryOp                 mul_26                   1 1 196 197 0=2 1=1 2=1.000000e-01
BinaryOp                 add_27                   2 1 197 188 198 0=0
ReLU                     relu_227                 1 1 198 199
Split                    splitncnn_15             1 3 199 200 201 202
Convolution              convrelu_76              1 1 202 203 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=114688 9=1
Convolution              convrelu_77              1 1 201 204 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=114688 9=1
Convolution              convrelu_78              1 1 204 205 0=128 1=7 11=1 12=1 13=1 14=0 2=1 3=1 4=3 5=1 6=114688 9=1
Convolution              convrelu_79              1 1 205 206 0=128 1=1 11=7 12=1 13=1 14=3 2=1 3=1 4=0 5=1 6=114688 9=1
Concat                   cat_15                   2 1 203 206 207 0=0
Convolution              conv_96                  1 1 207 208 0=896 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=229376
BinaryOp                 mul_28                   1 1 208 209 0=2 1=1 2=1.000000e-01
BinaryOp                 add_29                   2 1 209 200 210 0=0
ReLU                     relu_232                 1 1 210 211
Split                    splitncnn_16             1 4 211 212 213 214 215
Convolution              convrelu_80              1 1 214 216 0=256 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=229376 9=1
Convolution              convrelu_81              1 1 216 217 0=384 1=3 11=3 12=1 13=2 14=0 2=1 3=2 4=0 5=1 6=884736 9=1
Convolution              convrelu_82              1 1 213 218 0=256 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=229376 9=1
Convolution              convrelu_83              1 1 218 219 0=256 1=3 11=3 12=1 13=2 14=0 2=1 3=2 4=0 5=1 6=589824 9=1
Convolution              convrelu_84              1 1 212 220 0=256 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=229376 9=1
Convolution              convrelu_85              1 1 220 221 0=256 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=589824 9=1
Convolution              convrelu_86              1 1 221 222 0=256 1=3 11=3 12=1 13=2 14=0 2=1 3=2 4=0 5=1 6=589824 9=1
Pooling                  maxpool2d_137            1 1 215 223 0=0 1=3 11=3 12=2 13=0 2=2 3=0 5=1
Concat                   cat_16                   4 1 217 219 222 223 224 0=0
Split                    splitncnn_17             1 3 224 225 226 227
Convolution              convrelu_87              1 1 227 228 0=192 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=344064 9=1
Convolution              convrelu_88              1 1 226 229 0=192 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=344064 9=1
Convolution              convrelu_89              1 1 229 230 0=192 1=3 11=1 12=1 13=1 14=0 2=1 3=1 4=1 5=1 6=110592 9=1
Convolution              convrelu_90              1 1 230 231 0=192 1=1 11=3 12=1 13=1 14=1 2=1 3=1 4=0 5=1 6=110592 9=1
Concat                   cat_17                   2 1 228 231 232 0=0
Convolution              conv_108                 1 1 232 233 0=1792 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=688128
BinaryOp                 mul_30                   1 1 233 234 0=2 1=1 2=2.000000e-01
BinaryOp                 add_31                   2 1 234 225 235 0=0
ReLU                     relu_244                 1 1 235 236
Split                    splitncnn_18             1 3 236 237 238 239
Convolution              convrelu_91              1 1 239 240 0=192 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=344064 9=1
Convolution              convrelu_92              1 1 238 241 0=192 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=344064 9=1
Convolution              convrelu_93              1 1 241 242 0=192 1=3 11=1 12=1 13=1 14=0 2=1 3=1 4=1 5=1 6=110592 9=1
Convolution              convrelu_94              1 1 242 243 0=192 1=1 11=3 12=1 13=1 14=1 2=1 3=1 4=0 5=1 6=110592 9=1
Concat                   cat_18                   2 1 240 243 244 0=0
Convolution              conv_113                 1 1 244 245 0=1792 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=688128
BinaryOp                 mul_32                   1 1 245 246 0=2 1=1 2=2.000000e-01
BinaryOp                 add_33                   2 1 246 237 247 0=0
ReLU                     relu_249                 1 1 247 248
Split                    splitncnn_19             1 3 248 249 250 251
Convolution              convrelu_95              1 1 251 252 0=192 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=344064 9=1
Convolution              convrelu_96              1 1 250 253 0=192 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=344064 9=1
Convolution              convrelu_97              1 1 253 254 0=192 1=3 11=1 12=1 13=1 14=0 2=1 3=1 4=1 5=1 6=110592 9=1
Convolution              convrelu_98              1 1 254 255 0=192 1=1 11=3 12=1 13=1 14=1 2=1 3=1 4=0 5=1 6=110592 9=1
Concat                   cat_19                   2 1 252 255 256 0=0
Convolution              conv_118                 1 1 256 257 0=1792 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=688128
BinaryOp                 mul_34                   1 1 257 258 0=2 1=1 2=2.000000e-01
BinaryOp                 add_35                   2 1 258 249 259 0=0
ReLU                     relu_254                 1 1 259 260
Split                    splitncnn_20             1 3 260 261 262 263
Convolution              convrelu_99              1 1 263 264 0=192 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=344064 9=1
Convolution              convrelu_100             1 1 262 265 0=192 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=344064 9=1
Convolution              convrelu_101             1 1 265 266 0=192 1=3 11=1 12=1 13=1 14=0 2=1 3=1 4=1 5=1 6=110592 9=1
Convolution              convrelu_102             1 1 266 267 0=192 1=1 11=3 12=1 13=1 14=1 2=1 3=1 4=0 5=1 6=110592 9=1
Concat                   cat_20                   2 1 264 267 268 0=0
Convolution              conv_123                 1 1 268 269 0=1792 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=688128
BinaryOp                 mul_36                   1 1 269 270 0=2 1=1 2=2.000000e-01
BinaryOp                 add_37                   2 1 270 261 271 0=0
ReLU                     relu_259                 1 1 271 272
Split                    splitncnn_21             1 3 272 273 274 275
Convolution              convrelu_103             1 1 275 276 0=192 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=344064 9=1
Convolution              convrelu_104             1 1 274 277 0=192 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=344064 9=1
Convolution              convrelu_105             1 1 277 278 0=192 1=3 11=1 12=1 13=1 14=0 2=1 3=1 4=1 5=1 6=110592 9=1
Convolution              convrelu_106             1 1 278 279 0=192 1=1 11=3 12=1 13=1 14=1 2=1 3=1 4=0 5=1 6=110592 9=1
Concat                   cat_21                   2 1 276 279 280 0=0
Convolution              conv_128                 1 1 280 281 0=1792 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=688128
BinaryOp                 mul_38                   1 1 281 282 0=2 1=1 2=2.000000e-01
BinaryOp                 add_39                   2 1 282 273 283 0=0
ReLU                     relu_264                 1 1 283 284
Split                    splitncnn_22             1 3 284 285 286 287
Convolution              convrelu_107             1 1 287 288 0=192 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=344064 9=1
Convolution              convrelu_108             1 1 286 289 0=192 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=344064 9=1
Convolution              convrelu_109             1 1 289 290 0=192 1=3 11=1 12=1 13=1 14=0 2=1 3=1 4=1 5=1 6=110592 9=1
Convolution              convrelu_110             1 1 290 291 0=192 1=1 11=3 12=1 13=1 14=1 2=1 3=1 4=0 5=1 6=110592 9=1
Concat                   cat_22                   2 1 288 291 292 0=0
Convolution              conv_133                 1 1 292 293 0=1792 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=688128
BinaryOp                 add_40                   2 1 293 285 294 0=0
Pooling                  gap_1                    1 1 294 295 0=1 4=1
Reshape                  view_269                 1 1 295 296 0=1792
InnerProduct             linear_134               1 1 296 297 0=512 1=1 2=917504
Normalize                normalize_0              1 1 297 out0 0=1 1=1 2=1.000000e-12 3=1 4=1 9=1
