7767517
370 466
Input                    in0                      0 1 in0
Convolution              convrelu_0               1 1 in0 1 0=16 1=3 11=3 12=1 13=2 14=1 2=1 3=2 4=1 5=1 6=432 9=1
Convolution              convrelu_1               1 1 1 2 0=32 1=3 11=3 12=1 13=2 14=1 2=1 3=2 4=1 5=1 6=4608 9=1
Convolution              convrelu_2               1 1 2 3 0=32 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=1024 9=1
Slice                    chunk_0                  1 2 3 4 5 -23300=2,-233,-233 1=0
Split                    splitncnn_0              1 2 5 6 7
Convolution              convrelu_3               1 1 7 8 0=16 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=2304 9=1
Split                    splitncnn_1              1 2 8 9 10
Convolution              convrelu_4               1 1 10 11 0=16 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=2304 9=1
Concat                   cat_0                    4 1 4 6 9 11 12 0=0
Convolution              convrelu_5               1 1 12 13 0=32 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=2048 9=1
Pooling                  avgpool2d_0              1 1 13 14 0=1 1=2 11=2 12=1 13=0 2=1 3=0 5=1 6=1
Convolution              convrelu_6               1 1 14 15 0=64 1=3 11=3 12=1 13=2 14=1 2=1 3=2 4=1 5=1 6=18432 9=1
Convolution              convrelu_7               1 1 15 16 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=4096 9=1
Slice                    chunk_1                  1 2 16 17 18 -23300=2,-233,-233 1=0
Split                    splitncnn_2              1 3 18 19 20 21
Convolution              convrelu_8               1 1 21 22 0=16 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=512 9=1
Split                    splitncnn_3              1 2 22 23 24
Convolution              convrelu_9               1 1 24 25 0=16 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=2304 9=1
Convolution              convrelu_10              1 1 25 26 0=16 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=2304 9=1
BinaryOp                 add_0                    2 1 23 26 27 0=0
Split                    splitncnn_4              1 2 27 28 29
Convolution              convrelu_11              1 1 29 30 0=16 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=2304 9=1
Convolution              convrelu_12              1 1 30 31 0=16 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=2304 9=1
BinaryOp                 add_1                    2 1 28 31 32 0=0
Split                    splitncnn_5              1 2 32 33 34
Convolution              convrelu_13              1 1 34 35 0=16 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=2304 9=1
Convolution              convrelu_14              1 1 35 36 0=16 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=2304 9=1
BinaryOp                 add_2                    2 1 33 36 37 0=0
Convolution              convrelu_15              1 1 20 38 0=16 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=512 9=1
Concat                   cat_1                    2 1 37 38 39 0=0
Convolution              convrelu_16              1 1 39 40 0=32 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=1024 9=1
Convolution              convrelu_17              1 1 40 41 0=32 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=9216 9=1
Split                    splitncnn_6              1 3 41 42 43 44
Convolution              convrelu_18              1 1 44 45 0=16 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=512 9=1
Split                    splitncnn_7              1 2 45 46 47
Convolution              convrelu_19              1 1 47 48 0=16 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=2304 9=1
Convolution              convrelu_20              1 1 48 49 0=16 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=2304 9=1
BinaryOp                 add_3                    2 1 46 49 50 0=0
Split                    splitncnn_8              1 2 50 51 52
Convolution              convrelu_21              1 1 52 53 0=16 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=2304 9=1
Convolution              convrelu_22              1 1 53 54 0=16 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=2304 9=1
BinaryOp                 add_4                    2 1 51 54 55 0=0
Split                    splitncnn_9              1 2 55 56 57
Convolution              convrelu_23              1 1 57 58 0=16 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=2304 9=1
Convolution              convrelu_24              1 1 58 59 0=16 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=2304 9=1
BinaryOp                 add_5                    2 1 56 59 60 0=0
Convolution              convrelu_25              1 1 43 61 0=16 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=512 9=1
Concat                   cat_2                    2 1 60 61 62 0=0
Convolution              convrelu_26              1 1 62 63 0=32 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=1024 9=1
Convolution              convrelu_27              1 1 63 64 0=32 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=9216 9=1
Concat                   cat_3                    4 1 17 19 42 64 65 0=0
Convolution              convrelu_28              1 1 65 66 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=8192 9=1
Split                    splitncnn_10             1 2 66 67 68
Pooling                  avgpool2d_1              1 1 68 69 0=1 1=2 11=2 12=1 13=0 2=1 3=0 5=1 6=1
Convolution              convrelu_29              1 1 69 70 0=96 1=3 11=3 12=1 13=2 14=1 2=1 3=2 4=1 5=1 6=55296 9=1
Convolution              convrelu_30              1 1 70 71 0=96 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=9216 9=1
Slice                    chunk_2                  1 2 71 72 73 -23300=2,-233,-233 1=0
Split                    splitncnn_11             1 3 73 74 75 76
Convolution              convrelu_31              1 1 76 77 0=24 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=1152 9=1
Split                    splitncnn_12             1 2 77 78 79
Convolution              convrelu_32              1 1 79 80 0=24 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=5184 9=1
Convolution              convrelu_33              1 1 80 81 0=24 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=5184 9=1
BinaryOp                 add_6                    2 1 78 81 82 0=0
Split                    splitncnn_13             1 2 82 83 84
Convolution              convrelu_34              1 1 84 85 0=24 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=5184 9=1
Convolution              convrelu_35              1 1 85 86 0=24 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=5184 9=1
BinaryOp                 add_7                    2 1 83 86 87 0=0
Split                    splitncnn_14             1 2 87 88 89
Convolution              convrelu_36              1 1 89 90 0=24 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=5184 9=1
Convolution              convrelu_37              1 1 90 91 0=24 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=5184 9=1
BinaryOp                 add_8                    2 1 88 91 92 0=0
Convolution              convrelu_38              1 1 75 93 0=24 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=1152 9=1
Concat                   cat_4                    2 1 92 93 94 0=0
Convolution              convrelu_39              1 1 94 95 0=48 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=2304 9=1
Convolution              convrelu_40              1 1 95 96 0=48 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=20736 9=1
Split                    splitncnn_15             1 3 96 97 98 99
Convolution              convrelu_41              1 1 99 100 0=24 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=1152 9=1
Split                    splitncnn_16             1 2 100 101 102
Convolution              convrelu_42              1 1 102 103 0=24 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=5184 9=1
Convolution              convrelu_43              1 1 103 104 0=24 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=5184 9=1
BinaryOp                 add_9                    2 1 101 104 105 0=0
Split                    splitncnn_17             1 2 105 106 107
Convolution              convrelu_44              1 1 107 108 0=24 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=5184 9=1
Convolution              convrelu_45              1 1 108 109 0=24 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=5184 9=1
BinaryOp                 add_10                   2 1 106 109 110 0=0
Split                    splitncnn_18             1 2 110 111 112
Convolution              convrelu_46              1 1 112 113 0=24 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=5184 9=1
Convolution              convrelu_47              1 1 113 114 0=24 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=5184 9=1
BinaryOp                 add_11                   2 1 111 114 115 0=0
Convolution              convrelu_48              1 1 98 116 0=24 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=1152 9=1
Concat                   cat_5                    2 1 115 116 117 0=0
Convolution              convrelu_49              1 1 117 118 0=48 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=2304 9=1
Convolution              convrelu_50              1 1 118 119 0=48 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=20736 9=1
Concat                   cat_6                    4 1 72 74 97 119 120 0=0
Convolution              convrelu_51              1 1 120 121 0=96 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=18432 9=1
Split                    splitncnn_19             1 2 121 122 123
Pooling                  avgpool2d_2              1 1 123 124 0=1 1=2 11=2 12=1 13=0 2=1 3=0 5=1 6=1
Convolution              convrelu_52              1 1 124 125 0=128 1=3 11=3 12=1 13=2 14=1 2=1 3=2 4=1 5=1 6=110592 9=1
Convolution              convrelu_53              1 1 125 126 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=16384 9=1
Slice                    chunk_3                  1 2 126 127 128 -23300=2,-233,-233 1=0
Split                    splitncnn_20             1 3 128 129 130 131
Convolution              convrelu_54              1 1 131 132 0=32 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=2048 9=1
Split                    splitncnn_21             1 2 132 133 134
Convolution              convrelu_55              1 1 134 135 0=32 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=9216 9=1
Convolution              convrelu_56              1 1 135 136 0=32 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=9216 9=1
BinaryOp                 add_12                   2 1 133 136 137 0=0
Split                    splitncnn_22             1 2 137 138 139
Convolution              convrelu_57              1 1 139 140 0=32 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=9216 9=1
Convolution              convrelu_58              1 1 140 141 0=32 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=9216 9=1
BinaryOp                 add_13                   2 1 138 141 142 0=0
Split                    splitncnn_23             1 2 142 143 144
Convolution              convrelu_59              1 1 144 145 0=32 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=9216 9=1
Convolution              convrelu_60              1 1 145 146 0=32 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=9216 9=1
BinaryOp                 add_14                   2 1 143 146 147 0=0
Convolution              convrelu_61              1 1 130 148 0=32 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=2048 9=1
Concat                   cat_7                    2 1 147 148 149 0=0
Convolution              convrelu_62              1 1 149 150 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=4096 9=1
Convolution              convrelu_63              1 1 150 151 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=36864 9=1
Split                    splitncnn_24             1 3 151 152 153 154
Convolution              convrelu_64              1 1 154 155 0=32 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=2048 9=1
Split                    splitncnn_25             1 2 155 156 157
Convolution              convrelu_65              1 1 157 158 0=32 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=9216 9=1
Convolution              convrelu_66              1 1 158 159 0=32 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=9216 9=1
BinaryOp                 add_15                   2 1 156 159 160 0=0
Split                    splitncnn_26             1 2 160 161 162
Convolution              convrelu_67              1 1 162 163 0=32 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=9216 9=1
Convolution              convrelu_68              1 1 163 164 0=32 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=9216 9=1
BinaryOp                 add_16                   2 1 161 164 165 0=0
Split                    splitncnn_27             1 2 165 166 167
Convolution              convrelu_69              1 1 167 168 0=32 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=9216 9=1
Convolution              convrelu_70              1 1 168 169 0=32 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=9216 9=1
BinaryOp                 add_17                   2 1 166 169 170 0=0
Convolution              convrelu_71              1 1 153 171 0=32 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=2048 9=1
Concat                   cat_8                    2 1 170 171 172 0=0
Convolution              convrelu_72              1 1 172 173 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=4096 9=1
Convolution              convrelu_73              1 1 173 174 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=36864 9=1
Concat                   cat_9                    4 1 127 129 152 174 175 0=0
Convolution              convrelu_74              1 1 175 176 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=32768 9=1
Convolution              convrelu_75              1 1 176 177 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=8192 9=1
Split                    splitncnn_28             1 2 177 178 179
Pooling                  maxpool2d_187            1 1 179 180 0=0 1=5 11=5 12=1 13=2 2=1 3=2 5=1
Split                    splitncnn_29             1 2 180 181 182
Pooling                  maxpool2d_188            1 1 182 183 0=0 1=5 11=5 12=1 13=2 2=1 3=2 5=1
Split                    splitncnn_30             1 2 183 184 185
Pooling                  maxpool2d_189            1 1 185 186 0=0 1=5 11=5 12=1 13=2 2=1 3=2 5=1
Concat                   cat_10                   4 1 178 181 184 186 187 0=0
Convolution              convrelu_76              1 1 187 188 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=32768 9=1
Split                    splitncnn_31             1 2 188 189 190
Interp                   upsample_369             1 1 190 191 0=1 1=2.000000e+00 2=2.000000e+00 6=0
Concat                   cat_11                   2 1 191 122 192 0=0
Convolution              convrelu_77              1 1 192 193 0=96 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=21504 9=1
Slice                    chunk_4                  1 2 193 194 195 -23300=2,-233,-233 1=0
Split                    splitncnn_32             1 3 195 196 197 198
Convolution              convrelu_78              1 1 198 199 0=24 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=1152 9=1
Split                    splitncnn_33             1 2 199 200 201
Convolution              convrelu_79              1 1 201 202 0=24 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=5184 9=1
Convolution              convrelu_80              1 1 202 203 0=24 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=5184 9=1
BinaryOp                 add_18                   2 1 200 203 204 0=0
Split                    splitncnn_34             1 2 204 205 206
Convolution              convrelu_81              1 1 206 207 0=24 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=5184 9=1
Convolution              convrelu_82              1 1 207 208 0=24 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=5184 9=1
BinaryOp                 add_19                   2 1 205 208 209 0=0
Split                    splitncnn_35             1 2 209 210 211
Convolution              convrelu_83              1 1 211 212 0=24 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=5184 9=1
Convolution              convrelu_84              1 1 212 213 0=24 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=5184 9=1
BinaryOp                 add_20                   2 1 210 213 214 0=0
Convolution              convrelu_85              1 1 197 215 0=24 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=1152 9=1
Concat                   cat_12                   2 1 214 215 216 0=0
Convolution              convrelu_86              1 1 216 217 0=48 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=2304 9=1
Convolution              convrelu_87              1 1 217 218 0=48 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=20736 9=1
Split                    splitncnn_36             1 3 218 219 220 221
Convolution              convrelu_88              1 1 221 222 0=24 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=1152 9=1
Split                    splitncnn_37             1 2 222 223 224
Convolution              convrelu_89              1 1 224 225 0=24 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=5184 9=1
Convolution              convrelu_90              1 1 225 226 0=24 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=5184 9=1
BinaryOp                 add_21                   2 1 223 226 227 0=0
Split                    splitncnn_38             1 2 227 228 229
Convolution              convrelu_91              1 1 229 230 0=24 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=5184 9=1
Convolution              convrelu_92              1 1 230 231 0=24 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=5184 9=1
BinaryOp                 add_22                   2 1 228 231 232 0=0
Split                    splitncnn_39             1 2 232 233 234
Convolution              convrelu_93              1 1 234 235 0=24 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=5184 9=1
Convolution              convrelu_94              1 1 235 236 0=24 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=5184 9=1
BinaryOp                 add_23                   2 1 233 236 237 0=0
Convolution              convrelu_95              1 1 220 238 0=24 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=1152 9=1
Concat                   cat_13                   2 1 237 238 239 0=0
Convolution              convrelu_96              1 1 239 240 0=48 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=2304 9=1
Convolution              convrelu_97              1 1 240 241 0=48 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=20736 9=1
Concat                   cat_14                   4 1 194 196 219 241 242 0=0
Convolution              convrelu_98              1 1 242 243 0=96 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=18432 9=1
Split                    splitncnn_40             1 2 243 244 245
Interp                   upsample_370             1 1 245 246 0=1 1=2.000000e+00 2=2.000000e+00 6=0
Concat                   cat_15                   2 1 246 67 247 0=0
Convolution              convrelu_99              1 1 247 248 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=10240 9=1
Slice                    chunk_5                  1 2 248 249 250 -23300=2,-233,-233 1=0
Split                    splitncnn_41             1 3 250 251 252 253
Convolution              convrelu_100             1 1 253 254 0=16 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=512 9=1
Split                    splitncnn_42             1 2 254 255 256
Convolution              convrelu_101             1 1 256 257 0=16 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=2304 9=1
Convolution              convrelu_102             1 1 257 258 0=16 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=2304 9=1
BinaryOp                 add_24                   2 1 255 258 259 0=0
Split                    splitncnn_43             1 2 259 260 261
Convolution              convrelu_103             1 1 261 262 0=16 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=2304 9=1
Convolution              convrelu_104             1 1 262 263 0=16 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=2304 9=1
BinaryOp                 add_25                   2 1 260 263 264 0=0
Split                    splitncnn_44             1 2 264 265 266
Convolution              convrelu_105             1 1 266 267 0=16 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=2304 9=1
Convolution              convrelu_106             1 1 267 268 0=16 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=2304 9=1
BinaryOp                 add_26                   2 1 265 268 269 0=0
Convolution              convrelu_107             1 1 252 270 0=16 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=512 9=1
Concat                   cat_16                   2 1 269 270 271 0=0
Convolution              convrelu_108             1 1 271 272 0=32 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=1024 9=1
Convolution              convrelu_109             1 1 272 273 0=32 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=9216 9=1
Split                    splitncnn_45             1 3 273 274 275 276
Convolution              convrelu_110             1 1 276 277 0=16 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=512 9=1
Split                    splitncnn_46             1 2 277 278 279
Convolution              convrelu_111             1 1 279 280 0=16 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=2304 9=1
Convolution              convrelu_112             1 1 280 281 0=16 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=2304 9=1
BinaryOp                 add_27                   2 1 278 281 282 0=0
Split                    splitncnn_47             1 2 282 283 284
Convolution              convrelu_113             1 1 284 285 0=16 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=2304 9=1
Convolution              convrelu_114             1 1 285 286 0=16 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=2304 9=1
BinaryOp                 add_28                   2 1 283 286 287 0=0
Split                    splitncnn_48             1 2 287 288 289
Convolution              convrelu_115             1 1 289 290 0=16 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=2304 9=1
Convolution              convrelu_116             1 1 290 291 0=16 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=2304 9=1
BinaryOp                 add_29                   2 1 288 291 292 0=0
Convolution              convrelu_117             1 1 275 293 0=16 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=512 9=1
Concat                   cat_17                   2 1 292 293 294 0=0
Convolution              convrelu_118             1 1 294 295 0=32 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=1024 9=1
Convolution              convrelu_119             1 1 295 296 0=32 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=9216 9=1
Concat                   cat_18                   4 1 249 251 274 296 297 0=0
Convolution              convrelu_120             1 1 297 298 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=8192 9=1
Split                    splitncnn_49             1 3 298 299 300 301
Pooling                  avgpool2d_3              1 1 299 302 0=1 1=2 11=2 12=1 13=0 2=1 3=0 5=1 6=1
Convolution              convrelu_121             1 1 302 303 0=48 1=3 11=3 12=1 13=2 14=1 2=1 3=2 4=1 5=1 6=27648 9=1
Concat                   cat_19                   2 1 303 244 304 0=0
Convolution              convrelu_122             1 1 304 305 0=96 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=13824 9=1
Slice                    chunk_6                  1 2 305 306 307 -23300=2,-233,-233 1=0
Split                    splitncnn_50             1 3 307 308 309 310
Convolution              convrelu_123             1 1 310 311 0=24 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=1152 9=1
Split                    splitncnn_51             1 2 311 312 313
Convolution              convrelu_124             1 1 313 314 0=24 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=5184 9=1
Convolution              convrelu_125             1 1 314 315 0=24 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=5184 9=1
BinaryOp                 add_30                   2 1 312 315 316 0=0
Split                    splitncnn_52             1 2 316 317 318
Convolution              convrelu_126             1 1 318 319 0=24 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=5184 9=1
Convolution              convrelu_127             1 1 319 320 0=24 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=5184 9=1
BinaryOp                 add_31                   2 1 317 320 321 0=0
Split                    splitncnn_53             1 2 321 322 323
Convolution              convrelu_128             1 1 323 324 0=24 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=5184 9=1
Convolution              convrelu_129             1 1 324 325 0=24 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=5184 9=1
BinaryOp                 add_32                   2 1 322 325 326 0=0
Convolution              convrelu_130             1 1 309 327 0=24 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=1152 9=1
Concat                   cat_20                   2 1 326 327 328 0=0
Convolution              convrelu_131             1 1 328 329 0=48 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=2304 9=1
Convolution              convrelu_132             1 1 329 330 0=48 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=20736 9=1
Split                    splitncnn_54             1 3 330 331 332 333
Convolution              convrelu_133             1 1 333 334 0=24 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=1152 9=1
Split                    splitncnn_55             1 2 334 335 336
Convolution              convrelu_134             1 1 336 337 0=24 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=5184 9=1
Convolution              convrelu_135             1 1 337 338 0=24 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=5184 9=1
BinaryOp                 add_33                   2 1 335 338 339 0=0
Split                    splitncnn_56             1 2 339 340 341
Convolution              convrelu_136             1 1 341 342 0=24 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=5184 9=1
Convolution              convrelu_137             1 1 342 343 0=24 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=5184 9=1
BinaryOp                 add_34                   2 1 340 343 344 0=0
Split                    splitncnn_57             1 2 344 345 346
Convolution              convrelu_138             1 1 346 347 0=24 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=5184 9=1
Convolution              convrelu_139             1 1 347 348 0=24 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=5184 9=1
BinaryOp                 add_35                   2 1 345 348 349 0=0
Convolution              convrelu_140             1 1 332 350 0=24 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=1152 9=1
Concat                   cat_21                   2 1 349 350 351 0=0
Convolution              convrelu_141             1 1 351 352 0=48 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=2304 9=1
Convolution              convrelu_142             1 1 352 353 0=48 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=20736 9=1
Concat                   cat_22                   4 1 306 308 331 353 354 0=0
Convolution              convrelu_143             1 1 354 355 0=96 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=18432 9=1
Split                    splitncnn_58             1 3 355 356 357 358
Pooling                  avgpool2d_4              1 1 356 359 0=1 1=2 11=2 12=1 13=0 2=1 3=0 5=1 6=1
Convolution              convrelu_144             1 1 359 360 0=64 1=3 11=3 12=1 13=2 14=1 2=1 3=2 4=1 5=1 6=55296 9=1
Concat                   cat_23                   2 1 360 189 361 0=0
Convolution              convrelu_145             1 1 361 362 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=24576 9=1
Slice                    chunk_7                  1 2 362 363 364 -23300=2,-233,-233 1=0
Split                    splitncnn_59             1 3 364 365 366 367
Convolution              convrelu_146             1 1 367 368 0=32 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=2048 9=1
Split                    splitncnn_60             1 2 368 369 370
Convolution              convrelu_147             1 1 370 371 0=32 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=9216 9=1
Convolution              convrelu_148             1 1 371 372 0=32 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=9216 9=1
BinaryOp                 add_36                   2 1 369 372 373 0=0
Split                    splitncnn_61             1 2 373 374 375
Convolution              convrelu_149             1 1 375 376 0=32 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=9216 9=1
Convolution              convrelu_150             1 1 376 377 0=32 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=9216 9=1
BinaryOp                 add_37                   2 1 374 377 378 0=0
Split                    splitncnn_62             1 2 378 379 380
Convolution              convrelu_151             1 1 380 381 0=32 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=9216 9=1
Convolution              convrelu_152             1 1 381 382 0=32 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=9216 9=1
BinaryOp                 add_38                   2 1 379 382 383 0=0
Convolution              convrelu_153             1 1 366 384 0=32 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=2048 9=1
Concat                   cat_24                   2 1 383 384 385 0=0
Convolution              convrelu_154             1 1 385 386 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=4096 9=1
Convolution              convrelu_155             1 1 386 387 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=36864 9=1
Split                    splitncnn_63             1 3 387 388 389 390
Convolution              convrelu_156             1 1 390 391 0=32 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=2048 9=1
Split                    splitncnn_64             1 2 391 392 393
Convolution              convrelu_157             1 1 393 394 0=32 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=9216 9=1
Convolution              convrelu_158             1 1 394 395 0=32 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=9216 9=1
BinaryOp                 add_39                   2 1 392 395 396 0=0
Split                    splitncnn_65             1 2 396 397 398
Convolution              convrelu_159             1 1 398 399 0=32 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=9216 9=1
Convolution              convrelu_160             1 1 399 400 0=32 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=9216 9=1
BinaryOp                 add_40                   2 1 397 400 401 0=0
Split                    splitncnn_66             1 2 401 402 403
Convolution              convrelu_161             1 1 403 404 0=32 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=9216 9=1
Convolution              convrelu_162             1 1 404 405 0=32 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=9216 9=1
BinaryOp                 add_41                   2 1 402 405 406 0=0
Convolution              convrelu_163             1 1 389 407 0=32 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=2048 9=1
Concat                   cat_25                   2 1 406 407 408 0=0
Convolution              convrelu_164             1 1 408 409 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=4096 9=1
Convolution              convrelu_165             1 1 409 410 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=36864 9=1
Concat                   cat_26                   4 1 363 365 388 410 411 0=0
Convolution              convrelu_166             1 1 411 412 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=32768 9=1
Split                    splitncnn_67             1 2 412 413 414
MemoryData               pnnx_262                 0 1 415 0=2100
Convolution              convrelu_167             1 1 301 416 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=36864 9=1
ConvolutionDepthWise     convdwrelu_0             1 1 416 417 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=9216 7=4 9=1
ConvolutionDepthWise     convdw_379               1 1 417 418 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=1024 7=4
Convolution              convrelu_168             1 1 300 419 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=36864 9=1
Convolution              convrelu_169             1 1 419 420 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=36864 9=1
Convolution              conv_177                 1 1 420 421 0=1 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=64
Concat                   cat_27                   2 1 418 421 422 0=0
Convolution              convrelu_170             1 1 358 423 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=55296 9=1
ConvolutionDepthWise     convdwrelu_1             1 1 423 424 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=9216 7=4 9=1
ConvolutionDepthWise     convdw_381               1 1 424 425 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=1024 7=4
Convolution              convrelu_171             1 1 357 426 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=55296 9=1
Convolution              convrelu_172             1 1 426 427 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=36864 9=1
Convolution              conv_181                 1 1 427 428 0=1 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=64
Concat                   cat_28                   2 1 425 428 429 0=0
Convolution              convrelu_173             1 1 414 430 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=73728 9=1
ConvolutionDepthWise     convdwrelu_2             1 1 430 431 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=9216 7=4 9=1
ConvolutionDepthWise     convdw_383               1 1 431 432 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=1024 7=4
Convolution              convrelu_174             1 1 413 433 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=73728 9=1
Convolution              convrelu_175             1 1 433 434 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=36864 9=1
Convolution              conv_185                 1 1 434 435 0=1 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=64
Concat                   cat_29                   2 1 432 435 436 0=0
Reshape                  view_372                 1 1 422 437 0=1600 1=65
Reshape                  view_373                 1 1 429 438 0=400 1=65
Reshape                  view_374                 1 1 436 439 0=100 1=65
Concat                   cat_30                   3 1 437 438 439 440 0=1
Slice                    split_0                  1 2 440 441 442 -23300=2,64,1 1=0
Reshape                  view_375                 1 1 441 443 0=2100 1=16 2=4
Permute                  transpose_377            1 1 443 444 0=2
Softmax                  softmax_6                1 1 444 445 0=0 1=1
Convolution              conv_186                 1 1 445 446 0=1 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=0 6=16
Reshape                  view_376                 1 1 446 447 0=2100 1=4
MemoryData               pnnx_fold_anchor_points.1 0 1 448 0=2100 1=2
MemoryData               pnnx_fold_anchor_points.1_1 0 1 449 0=2100 1=2
Slice                    split_1                  1 2 447 450 451 -23300=2,2,-233 1=0
BinaryOp                 sub_42                   2 1 448 450 452 0=1
Split                    splitncnn_68             1 2 452 453 454
BinaryOp                 add_43                   2 1 449 451 455 0=0
Split                    splitncnn_69             1 2 455 456 457
BinaryOp                 add_44                   2 1 453 456 458 0=0
BinaryOp                 div_45                   1 1 458 459 0=3 1=1 2=2.000000e+00
BinaryOp                 sub_46                   2 1 457 454 460 0=1
Concat                   cat_31                   2 1 459 460 461 0=0
Reshape                  reshape_371              1 1 415 462 0=2100 1=1
BinaryOp                 mul_47                   2 1 461 462 463 0=2
Sigmoid                  sigmoid_5                1 1 442 464
Concat                   cat_32                   2 1 463 464 out0 0=0
