7767517
432 509
Input                    in0                      0 1 in0
Convolution              conv_12                  1 1 in0 1 0=64 1=3 11=3 12=1 13=2 14=1 2=1 3=2 4=1 5=1 6=1728
Swish                    silu_154                 1 1 1 2
Convolution              conv_13                  1 1 2 3 0=128 1=3 11=3 12=1 13=2 14=1 2=1 3=2 4=1 5=1 6=73728
Swish                    silu_155                 1 1 3 4
Convolution              conv_14                  1 1 4 5 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=16384
Swish                    silu_156                 1 1 5 6
Slice                    chunk_0                  1 2 6 7 8 -23300=2,-233,-233 1=0
Split                    splitncnn_0              1 3 8 9 10 11
Convolution              conv_15                  1 1 11 12 0=32 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=2048
Swish                    silu_157                 1 1 12 13
Split                    splitncnn_1              1 2 13 14 15
Convolution              conv_16                  1 1 15 16 0=32 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=9216
Swish                    silu_158                 1 1 16 17
Convolution              conv_17                  1 1 17 18 0=32 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=9216
Swish                    silu_159                 1 1 18 19
BinaryOp                 add_0                    2 1 14 19 20 0=0
Convolution              conv_18                  1 1 10 21 0=32 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=2048
Swish                    silu_160                 1 1 21 22
Concat                   cat_0                    2 1 20 22 23 0=0
Convolution              conv_19                  1 1 23 24 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=4096
Swish                    silu_161                 1 1 24 25
Convolution              conv_20                  1 1 25 26 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=36864
Swish                    silu_162                 1 1 26 27
Split                    splitncnn_2              1 3 27 28 29 30
Convolution              conv_21                  1 1 30 31 0=32 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=2048
Swish                    silu_163                 1 1 31 32
Split                    splitncnn_3              1 2 32 33 34
Convolution              conv_22                  1 1 34 35 0=32 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=9216
Swish                    silu_164                 1 1 35 36
Convolution              conv_23                  1 1 36 37 0=32 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=9216
Swish                    silu_165                 1 1 37 38
BinaryOp                 add_1                    2 1 33 38 39 0=0
Convolution              conv_24                  1 1 29 40 0=32 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=2048
Swish                    silu_166                 1 1 40 41
Concat                   cat_1                    2 1 39 41 42 0=0
Convolution              conv_25                  1 1 42 43 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=4096
Swish                    silu_167                 1 1 43 44
Convolution              conv_26                  1 1 44 45 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=36864
Swish                    silu_168                 1 1 45 46
Concat                   cat_2                    4 1 7 9 28 46 47 0=0
Convolution              conv_27                  1 1 47 48 0=256 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=65536
Swish                    silu_169                 1 1 48 49
Pooling                  avgpool2d_0              1 1 49 50 0=1 1=2 11=2 12=1 13=0 2=1 3=0 5=1 6=1
Slice                    chunk_1                  1 2 50 51 52 -23300=2,-233,-233 1=0
Convolution              conv_28                  1 1 51 53 0=128 1=3 11=3 12=1 13=2 14=1 2=1 3=2 4=1 5=1 6=147456
Swish                    silu_170                 1 1 53 54
Pooling                  maxpool2d_5              1 1 52 55 0=0 1=3 11=3 12=2 13=1 2=2 3=1 5=1
Convolution              conv_29                  1 1 55 56 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=16384
Swish                    silu_171                 1 1 56 57
Concat                   cat_3                    2 1 54 57 58 0=0
Convolution              conv_30                  1 1 58 59 0=256 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=65536
Swish                    silu_172                 1 1 59 60
Slice                    chunk_2                  1 2 60 61 62 -23300=2,-233,-233 1=0
Split                    splitncnn_4              1 3 62 63 64 65
Convolution              conv_31                  1 1 65 66 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=8192
Swish                    silu_173                 1 1 66 67
Split                    splitncnn_5              1 2 67 68 69
Convolution              conv_32                  1 1 69 70 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=36864
Swish                    silu_174                 1 1 70 71
Convolution              conv_33                  1 1 71 72 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=36864
Swish                    silu_175                 1 1 72 73
BinaryOp                 add_2                    2 1 68 73 74 0=0
Convolution              conv_34                  1 1 64 75 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=8192
Swish                    silu_176                 1 1 75 76
Concat                   cat_4                    2 1 74 76 77 0=0
Convolution              conv_35                  1 1 77 78 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=16384
Swish                    silu_177                 1 1 78 79
Convolution              conv_36                  1 1 79 80 0=128 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=147456
Swish                    silu_178                 1 1 80 81
Split                    splitncnn_6              1 3 81 82 83 84
Convolution              conv_37                  1 1 84 85 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=8192
Swish                    silu_179                 1 1 85 86
Split                    splitncnn_7              1 2 86 87 88
Convolution              conv_38                  1 1 88 89 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=36864
Swish                    silu_180                 1 1 89 90
Convolution              conv_39                  1 1 90 91 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=36864
Swish                    silu_181                 1 1 91 92
BinaryOp                 add_3                    2 1 87 92 93 0=0
Convolution              conv_40                  1 1 83 94 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=8192
Swish                    silu_182                 1 1 94 95
Concat                   cat_5                    2 1 93 95 96 0=0
Convolution              conv_41                  1 1 96 97 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=16384
Swish                    silu_183                 1 1 97 98
Convolution              conv_42                  1 1 98 99 0=128 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=147456
Swish                    silu_184                 1 1 99 100
Concat                   cat_6                    4 1 61 63 82 100 101 0=0
Convolution              conv_43                  1 1 101 102 0=512 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=262144
Swish                    silu_185                 1 1 102 103
Split                    splitncnn_8              1 2 103 104 105
Pooling                  avgpool2d_1              1 1 105 106 0=1 1=2 11=2 12=1 13=0 2=1 3=0 5=1 6=1
Slice                    chunk_3                  1 2 106 107 108 -23300=2,-233,-233 1=0
Convolution              conv_44                  1 1 107 109 0=256 1=3 11=3 12=1 13=2 14=1 2=1 3=2 4=1 5=1 6=589824
Swish                    silu_186                 1 1 109 110
Pooling                  maxpool2d_6              1 1 108 111 0=0 1=3 11=3 12=2 13=1 2=2 3=1 5=1
Convolution              conv_45                  1 1 111 112 0=256 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=65536
Swish                    silu_187                 1 1 112 113
Concat                   cat_7                    2 1 110 113 114 0=0
Convolution              conv_46                  1 1 114 115 0=512 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=262144
Swish                    silu_188                 1 1 115 116
Slice                    chunk_4                  1 2 116 117 118 -23300=2,-233,-233 1=0
Split                    splitncnn_9              1 3 118 119 120 121
Convolution              conv_47                  1 1 121 122 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=32768
Swish                    silu_189                 1 1 122 123
Split                    splitncnn_10             1 2 123 124 125
Convolution              conv_48                  1 1 125 126 0=128 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=147456
Swish                    silu_190                 1 1 126 127
Convolution              conv_49                  1 1 127 128 0=128 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=147456
Swish                    silu_191                 1 1 128 129
BinaryOp                 add_4                    2 1 124 129 130 0=0
Convolution              conv_50                  1 1 120 131 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=32768
Swish                    silu_192                 1 1 131 132
Concat                   cat_8                    2 1 130 132 133 0=0
Convolution              conv_51                  1 1 133 134 0=256 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=65536
Swish                    silu_193                 1 1 134 135
Convolution              conv_52                  1 1 135 136 0=256 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=589824
Swish                    silu_194                 1 1 136 137
Split                    splitncnn_11             1 3 137 138 139 140
Convolution              conv_53                  1 1 140 141 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=32768
Swish                    silu_195                 1 1 141 142
Split                    splitncnn_12             1 2 142 143 144
Convolution              conv_54                  1 1 144 145 0=128 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=147456
Swish                    silu_196                 1 1 145 146
Convolution              conv_55                  1 1 146 147 0=128 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=147456
Swish                    silu_197                 1 1 147 148
BinaryOp                 add_5                    2 1 143 148 149 0=0
Convolution              conv_56                  1 1 139 150 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=32768
Swish                    silu_198                 1 1 150 151
Concat                   cat_9                    2 1 149 151 152 0=0
Convolution              conv_57                  1 1 152 153 0=256 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=65536
Swish                    silu_199                 1 1 153 154
Convolution              conv_58                  1 1 154 155 0=256 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=589824
Swish                    silu_200                 1 1 155 156
Concat                   cat_10                   4 1 117 119 138 156 157 0=0
Convolution              conv_59                  1 1 157 158 0=512 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=524288
Swish                    silu_201                 1 1 158 159
Split                    splitncnn_13             1 2 159 160 161
Pooling                  avgpool2d_2              1 1 161 162 0=1 1=2 11=2 12=1 13=0 2=1 3=0 5=1 6=1
Slice                    chunk_5                  1 2 162 163 164 -23300=2,-233,-233 1=0
Convolution              conv_60                  1 1 163 165 0=256 1=3 11=3 12=1 13=2 14=1 2=1 3=2 4=1 5=1 6=589824
Swish                    silu_202                 1 1 165 166
Pooling                  maxpool2d_7              1 1 164 167 0=0 1=3 11=3 12=2 13=1 2=2 3=1 5=1
Convolution              conv_61                  1 1 167 168 0=256 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=65536
Swish                    silu_203                 1 1 168 169
Concat                   cat_11                   2 1 166 169 170 0=0
Convolution              conv_62                  1 1 170 171 0=512 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=262144
Swish                    silu_204                 1 1 171 172
Slice                    chunk_6                  1 2 172 173 174 -23300=2,-233,-233 1=0
Split                    splitncnn_14             1 3 174 175 176 177
Convolution              conv_63                  1 1 177 178 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=32768
Swish                    silu_205                 1 1 178 179
Split                    splitncnn_15             1 2 179 180 181
Convolution              conv_64                  1 1 181 182 0=128 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=147456
Swish                    silu_206                 1 1 182 183
Convolution              conv_65                  1 1 183 184 0=128 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=147456
Swish                    silu_207                 1 1 184 185
BinaryOp                 add_6                    2 1 180 185 186 0=0
Convolution              conv_66                  1 1 176 187 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=32768
Swish                    silu_208                 1 1 187 188
Concat                   cat_12                   2 1 186 188 189 0=0
Convolution              conv_67                  1 1 189 190 0=256 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=65536
Swish                    silu_209                 1 1 190 191
Convolution              conv_68                  1 1 191 192 0=256 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=589824
Swish                    silu_210                 1 1 192 193
Split                    splitncnn_16             1 3 193 194 195 196
Convolution              conv_69                  1 1 196 197 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=32768
Swish                    silu_211                 1 1 197 198
Split                    splitncnn_17             1 2 198 199 200
Convolution              conv_70                  1 1 200 201 0=128 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=147456
Swish                    silu_212                 1 1 201 202
Convolution              conv_71                  1 1 202 203 0=128 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=147456
Swish                    silu_213                 1 1 203 204
BinaryOp                 add_7                    2 1 199 204 205 0=0
Convolution              conv_72                  1 1 195 206 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=32768
Swish                    silu_214                 1 1 206 207
Concat                   cat_13                   2 1 205 207 208 0=0
Convolution              conv_73                  1 1 208 209 0=256 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=65536
Swish                    silu_215                 1 1 209 210
Convolution              conv_74                  1 1 210 211 0=256 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=589824
Swish                    silu_216                 1 1 211 212
Concat                   cat_14                   4 1 173 175 194 212 213 0=0
Convolution              conv_75                  1 1 213 214 0=512 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=524288
Swish                    silu_217                 1 1 214 215
Convolution              conv_76                  1 1 215 216 0=256 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=131072
Swish                    silu_218                 1 1 216 217
Split                    splitncnn_18             1 2 217 218 219
Pooling                  maxpool2d_151            1 1 219 220 0=0 1=5 11=5 12=1 13=2 2=1 3=2 5=1
Split                    splitncnn_19             1 2 220 221 222
Pooling                  maxpool2d_152            1 1 222 223 0=0 1=5 11=5 12=1 13=2 2=1 3=2 5=1
Split                    splitncnn_20             1 2 223 224 225
Pooling                  maxpool2d_153            1 1 225 226 0=0 1=5 11=5 12=1 13=2 2=1 3=2 5=1
Concat                   cat_15                   4 1 218 221 224 226 227 0=0
Convolution              conv_77                  1 1 227 228 0=512 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=524288
Swish                    silu_219                 1 1 228 229
Split                    splitncnn_21             1 2 229 230 231
Interp                   upsample_292             1 1 231 232 0=1 1=2.000000e+00 2=2.000000e+00 6=0
Concat                   cat_16                   2 1 232 160 233 0=0
Convolution              conv_78                  1 1 233 234 0=512 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=524288
Swish                    silu_220                 1 1 234 235
Slice                    chunk_7                  1 2 235 236 237 -23300=2,-233,-233 1=0
Split                    splitncnn_22             1 3 237 238 239 240
Convolution              conv_79                  1 1 240 241 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=32768
Swish                    silu_221                 1 1 241 242
Split                    splitncnn_23             1 2 242 243 244
Convolution              conv_80                  1 1 244 245 0=128 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=147456
Swish                    silu_222                 1 1 245 246
Convolution              conv_81                  1 1 246 247 0=128 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=147456
Swish                    silu_223                 1 1 247 248
BinaryOp                 add_8                    2 1 243 248 249 0=0
Convolution              conv_82                  1 1 239 250 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=32768
Swish                    silu_224                 1 1 250 251
Concat                   cat_17                   2 1 249 251 252 0=0
Convolution              conv_83                  1 1 252 253 0=256 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=65536
Swish                    silu_225                 1 1 253 254
Convolution              conv_84                  1 1 254 255 0=256 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=589824
Swish                    silu_226                 1 1 255 256
Split                    splitncnn_24             1 3 256 257 258 259
Convolution              conv_85                  1 1 259 260 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=32768
Swish                    silu_227                 1 1 260 261
Split                    splitncnn_25             1 2 261 262 263
Convolution              conv_86                  1 1 263 264 0=128 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=147456
Swish                    silu_228                 1 1 264 265
Convolution              conv_87                  1 1 265 266 0=128 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=147456
Swish                    silu_229                 1 1 266 267
BinaryOp                 add_9                    2 1 262 267 268 0=0
Convolution              conv_88                  1 1 258 269 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=32768
Swish                    silu_230                 1 1 269 270
Concat                   cat_18                   2 1 268 270 271 0=0
Convolution              conv_89                  1 1 271 272 0=256 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=65536
Swish                    silu_231                 1 1 272 273
Convolution              conv_90                  1 1 273 274 0=256 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=589824
Swish                    silu_232                 1 1 274 275
Concat                   cat_19                   4 1 236 238 257 275 276 0=0
Convolution              conv_91                  1 1 276 277 0=512 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=524288
Swish                    silu_233                 1 1 277 278
Split                    splitncnn_26             1 2 278 279 280
Interp                   upsample_293             1 1 280 281 0=1 1=2.000000e+00 2=2.000000e+00 6=0
Concat                   cat_20                   2 1 281 104 282 0=0
Convolution              conv_92                  1 1 282 283 0=256 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=262144
Swish                    silu_234                 1 1 283 284
Slice                    chunk_8                  1 2 284 285 286 -23300=2,-233,-233 1=0
Split                    splitncnn_27             1 3 286 287 288 289
Convolution              conv_93                  1 1 289 290 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=8192
Swish                    silu_235                 1 1 290 291
Split                    splitncnn_28             1 2 291 292 293
Convolution              conv_94                  1 1 293 294 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=36864
Swish                    silu_236                 1 1 294 295
Convolution              conv_95                  1 1 295 296 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=36864
Swish                    silu_237                 1 1 296 297
BinaryOp                 add_10                   2 1 292 297 298 0=0
Convolution              conv_96                  1 1 288 299 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=8192
Swish                    silu_238                 1 1 299 300
Concat                   cat_21                   2 1 298 300 301 0=0
Convolution              conv_97                  1 1 301 302 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=16384
Swish                    silu_239                 1 1 302 303
Convolution              conv_98                  1 1 303 304 0=128 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=147456
Swish                    silu_240                 1 1 304 305
Split                    splitncnn_29             1 3 305 306 307 308
Convolution              conv_99                  1 1 308 309 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=8192
Swish                    silu_241                 1 1 309 310
Split                    splitncnn_30             1 2 310 311 312
Convolution              conv_100                 1 1 312 313 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=36864
Swish                    silu_242                 1 1 313 314
Convolution              conv_101                 1 1 314 315 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=36864
Swish                    silu_243                 1 1 315 316
BinaryOp                 add_11                   2 1 311 316 317 0=0
Convolution              conv_102                 1 1 307 318 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=8192
Swish                    silu_244                 1 1 318 319
Concat                   cat_22                   2 1 317 319 320 0=0
Convolution              conv_103                 1 1 320 321 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=16384
Swish                    silu_245                 1 1 321 322
Convolution              conv_104                 1 1 322 323 0=128 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=147456
Swish                    silu_246                 1 1 323 324
Concat                   cat_23                   4 1 285 287 306 324 325 0=0
Convolution              conv_105                 1 1 325 326 0=256 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=131072
Swish                    silu_247                 1 1 326 327
Split                    splitncnn_31             1 3 327 328 329 330
Pooling                  avgpool2d_3              1 1 328 331 0=1 1=2 11=2 12=1 13=0 2=1 3=0 5=1 6=1
Slice                    chunk_9                  1 2 331 332 333 -23300=2,-233,-233 1=0
Convolution              conv_106                 1 1 332 334 0=128 1=3 11=3 12=1 13=2 14=1 2=1 3=2 4=1 5=1 6=147456
Swish                    silu_248                 1 1 334 335
Pooling                  maxpool2d_8              1 1 333 336 0=0 1=3 11=3 12=2 13=1 2=2 3=1 5=1
Convolution              conv_107                 1 1 336 337 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=16384
Swish                    silu_249                 1 1 337 338
Concat                   cat_24                   2 1 335 338 339 0=0
Concat                   cat_25                   2 1 339 279 340 0=0
Convolution              conv_108                 1 1 340 341 0=512 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=393216
Swish                    silu_250                 1 1 341 342
Slice                    chunk_10                 1 2 342 343 344 -23300=2,-233,-233 1=0
Split                    splitncnn_32             1 3 344 345 346 347
Convolution              conv_109                 1 1 347 348 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=32768
Swish                    silu_251                 1 1 348 349
Split                    splitncnn_33             1 2 349 350 351
Convolution              conv_110                 1 1 351 352 0=128 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=147456
Swish                    silu_252                 1 1 352 353
Convolution              conv_111                 1 1 353 354 0=128 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=147456
Swish                    silu_253                 1 1 354 355
BinaryOp                 add_12                   2 1 350 355 356 0=0
Convolution              conv_112                 1 1 346 357 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=32768
Swish                    silu_254                 1 1 357 358
Concat                   cat_26                   2 1 356 358 359 0=0
Convolution              conv_113                 1 1 359 360 0=256 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=65536
Swish                    silu_255                 1 1 360 361
Convolution              conv_114                 1 1 361 362 0=256 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=589824
Swish                    silu_256                 1 1 362 363
Split                    splitncnn_34             1 3 363 364 365 366
Convolution              conv_115                 1 1 366 367 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=32768
Swish                    silu_257                 1 1 367 368
Split                    splitncnn_35             1 2 368 369 370
Convolution              conv_116                 1 1 370 371 0=128 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=147456
Swish                    silu_258                 1 1 371 372
Convolution              conv_117                 1 1 372 373 0=128 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=147456
Swish                    silu_259                 1 1 373 374
BinaryOp                 add_13                   2 1 369 374 375 0=0
Convolution              conv_118                 1 1 365 376 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=32768
Swish                    silu_260                 1 1 376 377
Concat                   cat_27                   2 1 375 377 378 0=0
Convolution              conv_119                 1 1 378 379 0=256 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=65536
Swish                    silu_261                 1 1 379 380
Convolution              conv_120                 1 1 380 381 0=256 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=589824
Swish                    silu_262                 1 1 381 382
Concat                   cat_28                   4 1 343 345 364 382 383 0=0
Convolution              conv_121                 1 1 383 384 0=512 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=524288
Swish                    silu_263                 1 1 384 385
Split                    splitncnn_36             1 3 385 386 387 388
Pooling                  avgpool2d_4              1 1 386 389 0=1 1=2 11=2 12=1 13=0 2=1 3=0 5=1 6=1
Slice                    chunk_11                 1 2 389 390 391 -23300=2,-233,-233 1=0
Convolution              conv_122                 1 1 390 392 0=256 1=3 11=3 12=1 13=2 14=1 2=1 3=2 4=1 5=1 6=589824
Swish                    silu_264                 1 1 392 393
Pooling                  maxpool2d_9              1 1 391 394 0=0 1=3 11=3 12=2 13=1 2=2 3=1 5=1
Convolution              conv_123                 1 1 394 395 0=256 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=65536
Swish                    silu_265                 1 1 395 396
Concat                   cat_29                   2 1 393 396 397 0=0
Concat                   cat_30                   2 1 397 230 398 0=0
Convolution              conv_124                 1 1 398 399 0=512 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=524288
Swish                    silu_266                 1 1 399 400
Slice                    chunk_12                 1 2 400 401 402 -23300=2,-233,-233 1=0
Split                    splitncnn_37             1 3 402 403 404 405
Convolution              conv_125                 1 1 405 406 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=32768
Swish                    silu_267                 1 1 406 407
Split                    splitncnn_38             1 2 407 408 409
Convolution              conv_126                 1 1 409 410 0=128 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=147456
Swish                    silu_268                 1 1 410 411
Convolution              conv_127                 1 1 411 412 0=128 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=147456
Swish                    silu_269                 1 1 412 413
BinaryOp                 add_14                   2 1 408 413 414 0=0
Convolution              conv_128                 1 1 404 415 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=32768
Swish                    silu_270                 1 1 415 416
Concat                   cat_31                   2 1 414 416 417 0=0
Convolution              conv_129                 1 1 417 418 0=256 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=65536
Swish                    silu_271                 1 1 418 419
Convolution              conv_130                 1 1 419 420 0=256 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=589824
Swish                    silu_272                 1 1 420 421
Split                    splitncnn_39             1 3 421 422 423 424
Convolution              conv_131                 1 1 424 425 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=32768
Swish                    silu_273                 1 1 425 426
Split                    splitncnn_40             1 2 426 427 428
Convolution              conv_132                 1 1 428 429 0=128 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=147456
Swish                    silu_274                 1 1 429 430
Convolution              conv_133                 1 1 430 431 0=128 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=147456
Swish                    silu_275                 1 1 431 432
BinaryOp                 add_15                   2 1 427 432 433 0=0
Convolution              conv_134                 1 1 423 434 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=32768
Swish                    silu_276                 1 1 434 435
Concat                   cat_32                   2 1 433 435 436 0=0
Convolution              conv_135                 1 1 436 437 0=256 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=65536
Swish                    silu_277                 1 1 437 438
Convolution              conv_136                 1 1 438 439 0=256 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=589824
Swish                    silu_278                 1 1 439 440
Concat                   cat_33                   4 1 401 403 422 440 441 0=0
Convolution              conv_137                 1 1 441 442 0=512 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=524288
Swish                    silu_279                 1 1 442 443
Split                    splitncnn_41             1 2 443 444 445
MemoryData               pnnx_321                 0 1 446 0=2100
Convolution              conv_138                 1 1 330 447 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=147456
Swish                    silu_280                 1 1 447 448
ConvolutionDepthWise     convdw_301               1 1 448 449 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=9216 7=4
Swish                    silu_281                 1 1 449 450
ConvolutionDepthWise     convdw_302               1 1 450 451 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=1024 7=4
Convolution              conv_139                 1 1 329 452 0=256 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=589824
Swish                    silu_282                 1 1 452 453
Convolution              conv_140                 1 1 453 454 0=256 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=589824
Swish                    silu_283                 1 1 454 455
Convolution              conv_141                 1 1 455 456 0=3 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=768
Concat                   cat_34                   2 1 451 456 457 0=0
Convolution              conv_142                 1 1 388 458 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=294912
Swish                    silu_284                 1 1 458 459
ConvolutionDepthWise     convdw_303               1 1 459 460 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=9216 7=4
Swish                    silu_285                 1 1 460 461
ConvolutionDepthWise     convdw_304               1 1 461 462 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=1024 7=4
Convolution              conv_143                 1 1 387 463 0=256 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=1179648
Swish                    silu_286                 1 1 463 464
Convolution              conv_144                 1 1 464 465 0=256 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=589824
Swish                    silu_287                 1 1 465 466
Convolution              conv_145                 1 1 466 467 0=3 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=768
Concat                   cat_35                   2 1 462 467 468 0=0
Convolution              conv_146                 1 1 445 469 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=294912
Swish                    silu_288                 1 1 469 470
ConvolutionDepthWise     convdw_305               1 1 470 471 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=9216 7=4
Swish                    silu_289                 1 1 471 472
ConvolutionDepthWise     convdw_306               1 1 472 473 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=1024 7=4
Convolution              conv_147                 1 1 444 474 0=256 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=1179648
Swish                    silu_290                 1 1 474 475
Convolution              conv_148                 1 1 475 476 0=256 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=589824
Swish                    silu_291                 1 1 476 477
Convolution              conv_149                 1 1 477 478 0=3 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=768
Concat                   cat_36                   2 1 473 478 479 0=0
Reshape                  view_295                 1 1 457 480 0=1600 1=67
Reshape                  view_296                 1 1 468 481 0=400 1=67
Reshape                  view_297                 1 1 479 482 0=100 1=67
Concat                   cat_37                   3 1 480 481 482 483 0=1
Slice                    split_0                  1 2 483 484 485 -23300=2,64,3 1=0
Reshape                  view_298                 1 1 484 486 0=2100 1=16 2=4
Permute                  transpose_300            1 1 486 487 0=2
Softmax                  softmax_11               1 1 487 488 0=0 1=1
Convolution              conv_150                 1 1 488 489 0=1 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=0 6=16
Reshape                  view_299                 1 1 489 490 0=2100 1=4
MemoryData               pnnx_fold_anchor_points.1 0 1 491 0=2100 1=2
MemoryData               pnnx_fold_anchor_points.1_1 0 1 492 0=2100 1=2
Slice                    split_1                  1 2 490 493 494 -23300=2,2,-233 1=0
BinaryOp                 sub_16                   2 1 491 493 495 0=1
Split                    splitncnn_42             1 2 495 496 497
BinaryOp                 add_17                   2 1 492 494 498 0=0
Split                    splitncnn_43             1 2 498 499 500
BinaryOp                 add_18                   2 1 496 499 501 0=0
BinaryOp                 div_19                   1 1 501 502 0=3 1=1 2=2.000000e+00
BinaryOp                 sub_20                   2 1 500 497 503 0=1
Concat                   cat_38                   2 1 502 503 504 0=0
Reshape                  reshape_294              1 1 446 505 0=2100 1=1
BinaryOp                 mul_21                   2 1 504 505 506 0=2
Sigmoid                  sigmoid_10               1 1 485 507
Concat                   cat_39                   2 1 506 507 out0 0=0
