7767517
383 475
Input                    in0                      0 1 in0
Convolution              convclip_0               1 1 in0 1 0=32 1=3 -23310=2,0.000000e+00,6.000000e+00 11=3 12=1 13=2 14=1 2=1 3=2 4=1 5=1 6=864 9=3
Convolution              convclip_1               1 1 1 2 0=64 1=3 -23310=2,0.000000e+00,6.000000e+00 11=3 12=1 13=2 14=1 2=1 3=2 4=1 5=1 6=18432 9=3
Convolution              convclip_2               1 1 2 3 0=64 1=1 -23310=2,0.000000e+00,6.000000e+00 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=4096 9=3
Slice                    chunk_0                  1 2 3 4 5 -23300=2,-233,-233 1=0
Split                    splitncnn_0              1 2 5 6 7
Convolution              convclip_3               1 1 7 8 0=32 1=3 -23310=2,0.000000e+00,6.000000e+00 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=9216 9=3
Split                    splitncnn_1              1 2 8 9 10
Convolution              convclip_4               1 1 10 11 0=32 1=3 -23310=2,0.000000e+00,6.000000e+00 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=9216 9=3
Concat                   cat_0                    4 1 4 6 9 11 12 0=0
Convolution              convclip_5               1 1 12 13 0=64 1=1 -23310=2,0.000000e+00,6.000000e+00 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=8192 9=3
Pooling                  avgpool2d_0              1 1 13 14 0=1 1=2 11=2 12=1 13=0 2=1 3=0 5=1 6=1
Convolution              convclip_6               1 1 14 15 0=128 1=3 -23310=2,0.000000e+00,6.000000e+00 11=3 12=1 13=2 14=1 2=1 3=2 4=1 5=1 6=73728 9=3
Convolution              convclip_7               1 1 15 16 0=128 1=1 -23310=2,0.000000e+00,6.000000e+00 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=16384 9=3
Slice                    chunk_1                  1 2 16 17 18 -23300=2,-233,-233 1=0
Split                    splitncnn_2              1 3 18 19 20 21
Convolution              convclip_8               1 1 21 22 0=32 1=1 -23310=2,0.000000e+00,6.000000e+00 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=2048 9=3
Split                    splitncnn_3              1 2 22 23 24
Convolution              conv_14                  1 1 24 25 0=32 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=9216
Swish                    silu_330                 1 1 25 26
Convolution              convclip_9               1 1 26 27 0=32 1=3 -23310=2,0.000000e+00,6.000000e+00 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=9216 9=3
BinaryOp                 add_0                    2 1 23 27 28 0=0
Split                    splitncnn_4              1 2 28 29 30
Convolution              conv_16                  1 1 30 31 0=32 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=9216
Swish                    silu_331                 1 1 31 32
Convolution              convclip_10              1 1 32 33 0=32 1=3 -23310=2,0.000000e+00,6.000000e+00 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=9216 9=3
BinaryOp                 add_1                    2 1 29 33 34 0=0
Split                    splitncnn_5              1 2 34 35 36
Convolution              conv_18                  1 1 36 37 0=32 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=9216
Swish                    silu_332                 1 1 37 38
Convolution              convclip_11              1 1 38 39 0=32 1=3 -23310=2,0.000000e+00,6.000000e+00 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=9216 9=3
BinaryOp                 add_2                    2 1 35 39 40 0=0
Convolution              convclip_12              1 1 20 41 0=32 1=1 -23310=2,0.000000e+00,6.000000e+00 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=2048 9=3
Concat                   cat_1                    2 1 40 41 42 0=0
Convolution              convclip_13              1 1 42 43 0=64 1=1 -23310=2,0.000000e+00,6.000000e+00 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=4096 9=3
Convolution              convclip_14              1 1 43 44 0=64 1=3 -23310=2,0.000000e+00,6.000000e+00 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=36864 9=3
Split                    splitncnn_6              1 3 44 45 46 47
Convolution              convclip_15              1 1 47 48 0=32 1=1 -23310=2,0.000000e+00,6.000000e+00 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=2048 9=3
Split                    splitncnn_7              1 2 48 49 50
Convolution              conv_24                  1 1 50 51 0=32 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=9216
Swish                    silu_333                 1 1 51 52
Convolution              convclip_16              1 1 52 53 0=32 1=3 -23310=2,0.000000e+00,6.000000e+00 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=9216 9=3
BinaryOp                 add_3                    2 1 49 53 54 0=0
Split                    splitncnn_8              1 2 54 55 56
Convolution              conv_26                  1 1 56 57 0=32 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=9216
Swish                    silu_334                 1 1 57 58
Convolution              convclip_17              1 1 58 59 0=32 1=3 -23310=2,0.000000e+00,6.000000e+00 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=9216 9=3
BinaryOp                 add_4                    2 1 55 59 60 0=0
Split                    splitncnn_9              1 2 60 61 62
Convolution              conv_28                  1 1 62 63 0=32 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=9216
Swish                    silu_335                 1 1 63 64
Convolution              convclip_18              1 1 64 65 0=32 1=3 -23310=2,0.000000e+00,6.000000e+00 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=9216 9=3
BinaryOp                 add_5                    2 1 61 65 66 0=0
Convolution              convclip_19              1 1 46 67 0=32 1=1 -23310=2,0.000000e+00,6.000000e+00 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=2048 9=3
Concat                   cat_2                    2 1 66 67 68 0=0
Convolution              convclip_20              1 1 68 69 0=64 1=1 -23310=2,0.000000e+00,6.000000e+00 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=4096 9=3
Convolution              convclip_21              1 1 69 70 0=64 1=3 -23310=2,0.000000e+00,6.000000e+00 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=36864 9=3
Concat                   cat_3                    4 1 17 19 45 70 71 0=0
Convolution              convclip_22              1 1 71 72 0=128 1=1 -23310=2,0.000000e+00,6.000000e+00 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=32768 9=3
Split                    splitncnn_10             1 2 72 73 74
Pooling                  avgpool2d_1              1 1 74 75 0=1 1=2 11=2 12=1 13=0 2=1 3=0 5=1 6=1
Convolution              convclip_23              1 1 75 76 0=192 1=3 -23310=2,0.000000e+00,6.000000e+00 11=3 12=1 13=2 14=1 2=1 3=2 4=1 5=1 6=221184 9=3
Convolution              convclip_24              1 1 76 77 0=192 1=1 -23310=2,0.000000e+00,6.000000e+00 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=36864 9=3
Slice                    chunk_2                  1 2 77 78 79 -23300=2,-233,-233 1=0
Split                    splitncnn_11             1 3 79 80 81 82
Convolution              convclip_25              1 1 82 83 0=48 1=1 -23310=2,0.000000e+00,6.000000e+00 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=4608 9=3
Split                    splitncnn_12             1 2 83 84 85
Convolution              conv_37                  1 1 85 86 0=48 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=20736
Swish                    silu_336                 1 1 86 87
Convolution              convclip_26              1 1 87 88 0=48 1=3 -23310=2,0.000000e+00,6.000000e+00 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=20736 9=3
BinaryOp                 add_6                    2 1 84 88 89 0=0
Split                    splitncnn_13             1 2 89 90 91
Convolution              conv_39                  1 1 91 92 0=48 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=20736
Swish                    silu_337                 1 1 92 93
Convolution              convclip_27              1 1 93 94 0=48 1=3 -23310=2,0.000000e+00,6.000000e+00 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=20736 9=3
BinaryOp                 add_7                    2 1 90 94 95 0=0
Split                    splitncnn_14             1 2 95 96 97
Convolution              conv_41                  1 1 97 98 0=48 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=20736
Swish                    silu_338                 1 1 98 99
Convolution              convclip_28              1 1 99 100 0=48 1=3 -23310=2,0.000000e+00,6.000000e+00 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=20736 9=3
BinaryOp                 add_8                    2 1 96 100 101 0=0
Convolution              convclip_29              1 1 81 102 0=48 1=1 -23310=2,0.000000e+00,6.000000e+00 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=4608 9=3
Concat                   cat_4                    2 1 101 102 103 0=0
Convolution              convclip_30              1 1 103 104 0=96 1=1 -23310=2,0.000000e+00,6.000000e+00 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=9216 9=3
Convolution              convclip_31              1 1 104 105 0=96 1=3 -23310=2,0.000000e+00,6.000000e+00 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=82944 9=3
Split                    splitncnn_15             1 3 105 106 107 108
Convolution              convclip_32              1 1 108 109 0=48 1=1 -23310=2,0.000000e+00,6.000000e+00 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=4608 9=3
Split                    splitncnn_16             1 2 109 110 111
Convolution              conv_47                  1 1 111 112 0=48 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=20736
Swish                    silu_339                 1 1 112 113
Convolution              convclip_33              1 1 113 114 0=48 1=3 -23310=2,0.000000e+00,6.000000e+00 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=20736 9=3
BinaryOp                 add_9                    2 1 110 114 115 0=0
Split                    splitncnn_17             1 2 115 116 117
Convolution              conv_49                  1 1 117 118 0=48 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=20736
Swish                    silu_340                 1 1 118 119
Convolution              convclip_34              1 1 119 120 0=48 1=3 -23310=2,0.000000e+00,6.000000e+00 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=20736 9=3
BinaryOp                 add_10                   2 1 116 120 121 0=0
Split                    splitncnn_18             1 2 121 122 123
Convolution              conv_51                  1 1 123 124 0=48 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=20736
Swish                    silu_341                 1 1 124 125
Convolution              convclip_35              1 1 125 126 0=48 1=3 -23310=2,0.000000e+00,6.000000e+00 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=20736 9=3
BinaryOp                 add_11                   2 1 122 126 127 0=0
Convolution              convclip_36              1 1 107 128 0=48 1=1 -23310=2,0.000000e+00,6.000000e+00 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=4608 9=3
Concat                   cat_5                    2 1 127 128 129 0=0
Convolution              convclip_37              1 1 129 130 0=96 1=1 -23310=2,0.000000e+00,6.000000e+00 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=9216 9=3
Convolution              convclip_38              1 1 130 131 0=96 1=3 -23310=2,0.000000e+00,6.000000e+00 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=82944 9=3
Concat                   cat_6                    4 1 78 80 106 131 132 0=0
Convolution              convclip_39              1 1 132 133 0=192 1=1 -23310=2,0.000000e+00,6.000000e+00 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=73728 9=3
Split                    splitncnn_19             1 2 133 134 135
Pooling                  avgpool2d_2              1 1 135 136 0=1 1=2 11=2 12=1 13=0 2=1 3=0 5=1 6=1
Convolution              convclip_40              1 1 136 137 0=256 1=3 -23310=2,0.000000e+00,6.000000e+00 11=3 12=1 13=2 14=1 2=1 3=2 4=1 5=1 6=442368 9=3
Convolution              convclip_41              1 1 137 138 0=256 1=1 -23310=2,0.000000e+00,6.000000e+00 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=65536 9=3
Slice                    chunk_3                  1 2 138 139 140 -23300=2,-233,-233 1=0
Split                    splitncnn_20             1 3 140 141 142 143
Convolution              convclip_42              1 1 143 144 0=64 1=1 -23310=2,0.000000e+00,6.000000e+00 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=8192 9=3
Split                    splitncnn_21             1 2 144 145 146
Convolution              conv_60                  1 1 146 147 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=36864
Swish                    silu_342                 1 1 147 148
Convolution              convclip_43              1 1 148 149 0=64 1=3 -23310=2,0.000000e+00,6.000000e+00 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=36864 9=3
BinaryOp                 add_12                   2 1 145 149 150 0=0
Split                    splitncnn_22             1 2 150 151 152
Convolution              conv_62                  1 1 152 153 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=36864
Swish                    silu_343                 1 1 153 154
Convolution              convclip_44              1 1 154 155 0=64 1=3 -23310=2,0.000000e+00,6.000000e+00 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=36864 9=3
BinaryOp                 add_13                   2 1 151 155 156 0=0
Split                    splitncnn_23             1 2 156 157 158
Convolution              conv_64                  1 1 158 159 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=36864
Swish                    silu_344                 1 1 159 160
Convolution              convclip_45              1 1 160 161 0=64 1=3 -23310=2,0.000000e+00,6.000000e+00 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=36864 9=3
BinaryOp                 add_14                   2 1 157 161 162 0=0
Convolution              convclip_46              1 1 142 163 0=64 1=1 -23310=2,0.000000e+00,6.000000e+00 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=8192 9=3
Concat                   cat_7                    2 1 162 163 164 0=0
Convolution              convclip_47              1 1 164 165 0=128 1=1 -23310=2,0.000000e+00,6.000000e+00 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=16384 9=3
Convolution              convclip_48              1 1 165 166 0=128 1=3 -23310=2,0.000000e+00,6.000000e+00 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=147456 9=3
Split                    splitncnn_24             1 3 166 167 168 169
Convolution              convclip_49              1 1 169 170 0=64 1=1 -23310=2,0.000000e+00,6.000000e+00 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=8192 9=3
Split                    splitncnn_25             1 2 170 171 172
Convolution              conv_70                  1 1 172 173 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=36864
Swish                    silu_345                 1 1 173 174
Convolution              convclip_50              1 1 174 175 0=64 1=3 -23310=2,0.000000e+00,6.000000e+00 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=36864 9=3
BinaryOp                 add_15                   2 1 171 175 176 0=0
Split                    splitncnn_26             1 2 176 177 178
Convolution              conv_72                  1 1 178 179 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=36864
Swish                    silu_346                 1 1 179 180
Convolution              convclip_51              1 1 180 181 0=64 1=3 -23310=2,0.000000e+00,6.000000e+00 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=36864 9=3
BinaryOp                 add_16                   2 1 177 181 182 0=0
Split                    splitncnn_27             1 2 182 183 184
Convolution              conv_74                  1 1 184 185 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=36864
Swish                    silu_347                 1 1 185 186
Convolution              convclip_52              1 1 186 187 0=64 1=3 -23310=2,0.000000e+00,6.000000e+00 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=36864 9=3
BinaryOp                 add_17                   2 1 183 187 188 0=0
Convolution              convclip_53              1 1 168 189 0=64 1=1 -23310=2,0.000000e+00,6.000000e+00 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=8192 9=3
Concat                   cat_8                    2 1 188 189 190 0=0
Convolution              convclip_54              1 1 190 191 0=128 1=1 -23310=2,0.000000e+00,6.000000e+00 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=16384 9=3
Convolution              convclip_55              1 1 191 192 0=128 1=3 -23310=2,0.000000e+00,6.000000e+00 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=147456 9=3
Concat                   cat_9                    4 1 139 141 167 192 193 0=0
Convolution              convclip_56              1 1 193 194 0=256 1=1 -23310=2,0.000000e+00,6.000000e+00 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=131072 9=3
Convolution              convclip_57              1 1 194 195 0=128 1=1 -23310=2,0.000000e+00,6.000000e+00 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=32768 9=3
Split                    splitncnn_28             1 2 195 196 197
Pooling                  maxpool2d_190            1 1 197 198 0=0 1=5 11=5 12=1 13=2 2=1 3=2 5=1
Split                    splitncnn_29             1 2 198 199 200
Pooling                  maxpool2d_191            1 1 200 201 0=0 1=5 11=5 12=1 13=2 2=1 3=2 5=1
Split                    splitncnn_30             1 2 201 202 203
Pooling                  maxpool2d_192            1 1 203 204 0=0 1=5 11=5 12=1 13=2 2=1 3=2 5=1
Concat                   cat_10                   4 1 196 199 202 204 205 0=0
Convolution              convclip_58              1 1 205 206 0=256 1=1 -23310=2,0.000000e+00,6.000000e+00 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=131072 9=3
Split                    splitncnn_31             1 2 206 207 208
Interp                   upsample_372             1 1 208 209 0=1 1=2.000000e+00 2=2.000000e+00 6=0
Concat                   cat_11                   2 1 209 134 210 0=0
Convolution              convclip_59              1 1 210 211 0=192 1=1 -23310=2,0.000000e+00,6.000000e+00 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=86016 9=3
Slice                    chunk_4                  1 2 211 212 213 -23300=2,-233,-233 1=0
Split                    splitncnn_32             1 3 213 214 215 216
Convolution              convclip_60              1 1 216 217 0=48 1=1 -23310=2,0.000000e+00,6.000000e+00 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=4608 9=3
Split                    splitncnn_33             1 2 217 218 219
Convolution              conv_84                  1 1 219 220 0=48 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=20736
Swish                    silu_348                 1 1 220 221
Convolution              convclip_61              1 1 221 222 0=48 1=3 -23310=2,0.000000e+00,6.000000e+00 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=20736 9=3
BinaryOp                 add_18                   2 1 218 222 223 0=0
Split                    splitncnn_34             1 2 223 224 225
Convolution              conv_86                  1 1 225 226 0=48 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=20736
Swish                    silu_349                 1 1 226 227
Convolution              convclip_62              1 1 227 228 0=48 1=3 -23310=2,0.000000e+00,6.000000e+00 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=20736 9=3
BinaryOp                 add_19                   2 1 224 228 229 0=0
Split                    splitncnn_35             1 2 229 230 231
Convolution              conv_88                  1 1 231 232 0=48 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=20736
Swish                    silu_350                 1 1 232 233
Convolution              convclip_63              1 1 233 234 0=48 1=3 -23310=2,0.000000e+00,6.000000e+00 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=20736 9=3
BinaryOp                 add_20                   2 1 230 234 235 0=0
Convolution              convclip_64              1 1 215 236 0=48 1=1 -23310=2,0.000000e+00,6.000000e+00 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=4608 9=3
Concat                   cat_12                   2 1 235 236 237 0=0
Convolution              convclip_65              1 1 237 238 0=96 1=1 -23310=2,0.000000e+00,6.000000e+00 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=9216 9=3
Convolution              convclip_66              1 1 238 239 0=96 1=3 -23310=2,0.000000e+00,6.000000e+00 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=82944 9=3
Split                    splitncnn_36             1 3 239 240 241 242
Convolution              convclip_67              1 1 242 243 0=48 1=1 -23310=2,0.000000e+00,6.000000e+00 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=4608 9=3
Split                    splitncnn_37             1 2 243 244 245
Convolution              conv_94                  1 1 245 246 0=48 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=20736
Swish                    silu_351                 1 1 246 247
Convolution              convclip_68              1 1 247 248 0=48 1=3 -23310=2,0.000000e+00,6.000000e+00 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=20736 9=3
BinaryOp                 add_21                   2 1 244 248 249 0=0
Split                    splitncnn_38             1 2 249 250 251
Convolution              conv_96                  1 1 251 252 0=48 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=20736
Swish                    silu_352                 1 1 252 253
Convolution              convclip_69              1 1 253 254 0=48 1=3 -23310=2,0.000000e+00,6.000000e+00 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=20736 9=3
BinaryOp                 add_22                   2 1 250 254 255 0=0
Split                    splitncnn_39             1 2 255 256 257
Convolution              conv_98                  1 1 257 258 0=48 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=20736
Swish                    silu_353                 1 1 258 259
Convolution              convclip_70              1 1 259 260 0=48 1=3 -23310=2,0.000000e+00,6.000000e+00 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=20736 9=3
BinaryOp                 add_23                   2 1 256 260 261 0=0
Convolution              convclip_71              1 1 241 262 0=48 1=1 -23310=2,0.000000e+00,6.000000e+00 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=4608 9=3
Concat                   cat_13                   2 1 261 262 263 0=0
Convolution              convclip_72              1 1 263 264 0=96 1=1 -23310=2,0.000000e+00,6.000000e+00 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=9216 9=3
Convolution              convclip_73              1 1 264 265 0=96 1=3 -23310=2,0.000000e+00,6.000000e+00 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=82944 9=3
Concat                   cat_14                   4 1 212 214 240 265 266 0=0
Convolution              convclip_74              1 1 266 267 0=192 1=1 -23310=2,0.000000e+00,6.000000e+00 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=73728 9=3
Split                    splitncnn_40             1 2 267 268 269
Interp                   upsample_373             1 1 269 270 0=1 1=2.000000e+00 2=2.000000e+00 6=0
Concat                   cat_15                   2 1 270 73 271 0=0
Convolution              convclip_75              1 1 271 272 0=128 1=1 -23310=2,0.000000e+00,6.000000e+00 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=40960 9=3
Slice                    chunk_5                  1 2 272 273 274 -23300=2,-233,-233 1=0
Split                    splitncnn_41             1 3 274 275 276 277
Convolution              convclip_76              1 1 277 278 0=32 1=1 -23310=2,0.000000e+00,6.000000e+00 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=2048 9=3
Split                    splitncnn_42             1 2 278 279 280
Convolution              conv_106                 1 1 280 281 0=32 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=9216
Swish                    silu_354                 1 1 281 282
Convolution              convclip_77              1 1 282 283 0=32 1=3 -23310=2,0.000000e+00,6.000000e+00 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=9216 9=3
BinaryOp                 add_24                   2 1 279 283 284 0=0
Split                    splitncnn_43             1 2 284 285 286
Convolution              conv_108                 1 1 286 287 0=32 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=9216
Swish                    silu_355                 1 1 287 288
Convolution              convclip_78              1 1 288 289 0=32 1=3 -23310=2,0.000000e+00,6.000000e+00 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=9216 9=3
BinaryOp                 add_25                   2 1 285 289 290 0=0
Split                    splitncnn_44             1 2 290 291 292
Convolution              conv_110                 1 1 292 293 0=32 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=9216
Swish                    silu_356                 1 1 293 294
Convolution              convclip_79              1 1 294 295 0=32 1=3 -23310=2,0.000000e+00,6.000000e+00 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=9216 9=3
BinaryOp                 add_26                   2 1 291 295 296 0=0
Convolution              convclip_80              1 1 276 297 0=32 1=1 -23310=2,0.000000e+00,6.000000e+00 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=2048 9=3
Concat                   cat_16                   2 1 296 297 298 0=0
Convolution              convclip_81              1 1 298 299 0=64 1=1 -23310=2,0.000000e+00,6.000000e+00 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=4096 9=3
Convolution              convclip_82              1 1 299 300 0=64 1=3 -23310=2,0.000000e+00,6.000000e+00 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=36864 9=3
Split                    splitncnn_45             1 3 300 301 302 303
Convolution              convclip_83              1 1 303 304 0=32 1=1 -23310=2,0.000000e+00,6.000000e+00 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=2048 9=3
Split                    splitncnn_46             1 2 304 305 306
Convolution              conv_116                 1 1 306 307 0=32 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=9216
Swish                    silu_357                 1 1 307 308
Convolution              convclip_84              1 1 308 309 0=32 1=3 -23310=2,0.000000e+00,6.000000e+00 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=9216 9=3
BinaryOp                 add_27                   2 1 305 309 310 0=0
Split                    splitncnn_47             1 2 310 311 312
Convolution              conv_118                 1 1 312 313 0=32 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=9216
Swish                    silu_358                 1 1 313 314
Convolution              convclip_85              1 1 314 315 0=32 1=3 -23310=2,0.000000e+00,6.000000e+00 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=9216 9=3
BinaryOp                 add_28                   2 1 311 315 316 0=0
Split                    splitncnn_48             1 2 316 317 318
Convolution              conv_120                 1 1 318 319 0=32 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=9216
Swish                    silu_359                 1 1 319 320
Convolution              convclip_86              1 1 320 321 0=32 1=3 -23310=2,0.000000e+00,6.000000e+00 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=9216 9=3
BinaryOp                 add_29                   2 1 317 321 322 0=0
Convolution              convclip_87              1 1 302 323 0=32 1=1 -23310=2,0.000000e+00,6.000000e+00 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=2048 9=3
Concat                   cat_17                   2 1 322 323 324 0=0
Convolution              convclip_88              1 1 324 325 0=64 1=1 -23310=2,0.000000e+00,6.000000e+00 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=4096 9=3
Convolution              convclip_89              1 1 325 326 0=64 1=3 -23310=2,0.000000e+00,6.000000e+00 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=36864 9=3
Concat                   cat_18                   4 1 273 275 301 326 327 0=0
Convolution              convclip_90              1 1 327 328 0=128 1=1 -23310=2,0.000000e+00,6.000000e+00 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=32768 9=3
Split                    splitncnn_49             1 3 328 329 330 331
Pooling                  avgpool2d_3              1 1 329 332 0=1 1=2 11=2 12=1 13=0 2=1 3=0 5=1 6=1
Convolution              convclip_91              1 1 332 333 0=96 1=3 -23310=2,0.000000e+00,6.000000e+00 11=3 12=1 13=2 14=1 2=1 3=2 4=1 5=1 6=110592 9=3
Concat                   cat_19                   2 1 333 268 334 0=0
Convolution              convclip_92              1 1 334 335 0=192 1=1 -23310=2,0.000000e+00,6.000000e+00 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=55296 9=3
Slice                    chunk_6                  1 2 335 336 337 -23300=2,-233,-233 1=0
Split                    splitncnn_50             1 3 337 338 339 340
Convolution              convclip_93              1 1 340 341 0=48 1=1 -23310=2,0.000000e+00,6.000000e+00 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=4608 9=3
Split                    splitncnn_51             1 2 341 342 343
Convolution              conv_129                 1 1 343 344 0=48 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=20736
Swish                    silu_360                 1 1 344 345
Convolution              convclip_94              1 1 345 346 0=48 1=3 -23310=2,0.000000e+00,6.000000e+00 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=20736 9=3
BinaryOp                 add_30                   2 1 342 346 347 0=0
Split                    splitncnn_52             1 2 347 348 349
Convolution              conv_131                 1 1 349 350 0=48 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=20736
Swish                    silu_361                 1 1 350 351
Convolution              convclip_95              1 1 351 352 0=48 1=3 -23310=2,0.000000e+00,6.000000e+00 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=20736 9=3
BinaryOp                 add_31                   2 1 348 352 353 0=0
Split                    splitncnn_53             1 2 353 354 355
Convolution              conv_133                 1 1 355 356 0=48 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=20736
Swish                    silu_362                 1 1 356 357
Convolution              convclip_96              1 1 357 358 0=48 1=3 -23310=2,0.000000e+00,6.000000e+00 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=20736 9=3
BinaryOp                 add_32                   2 1 354 358 359 0=0
Convolution              convclip_97              1 1 339 360 0=48 1=1 -23310=2,0.000000e+00,6.000000e+00 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=4608 9=3
Concat                   cat_20                   2 1 359 360 361 0=0
Convolution              convclip_98              1 1 361 362 0=96 1=1 -23310=2,0.000000e+00,6.000000e+00 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=9216 9=3
Convolution              convclip_99              1 1 362 363 0=96 1=3 -23310=2,0.000000e+00,6.000000e+00 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=82944 9=3
Split                    splitncnn_54             1 3 363 364 365 366
Convolution              convclip_100             1 1 366 367 0=48 1=1 -23310=2,0.000000e+00,6.000000e+00 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=4608 9=3
Split                    splitncnn_55             1 2 367 368 369
Convolution              conv_139                 1 1 369 370 0=48 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=20736
Swish                    silu_363                 1 1 370 371
Convolution              convclip_101             1 1 371 372 0=48 1=3 -23310=2,0.000000e+00,6.000000e+00 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=20736 9=3
BinaryOp                 add_33                   2 1 368 372 373 0=0
Split                    splitncnn_56             1 2 373 374 375
Convolution              conv_141                 1 1 375 376 0=48 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=20736
Swish                    silu_364                 1 1 376 377
Convolution              convclip_102             1 1 377 378 0=48 1=3 -23310=2,0.000000e+00,6.000000e+00 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=20736 9=3
BinaryOp                 add_34                   2 1 374 378 379 0=0
Split                    splitncnn_57             1 2 379 380 381
Convolution              conv_143                 1 1 381 382 0=48 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=20736
Swish                    silu_365                 1 1 382 383
Convolution              convclip_103             1 1 383 384 0=48 1=3 -23310=2,0.000000e+00,6.000000e+00 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=20736 9=3
BinaryOp                 add_35                   2 1 380 384 385 0=0
Convolution              convclip_104             1 1 365 386 0=48 1=1 -23310=2,0.000000e+00,6.000000e+00 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=4608 9=3
Concat                   cat_21                   2 1 385 386 387 0=0
Convolution              convclip_105             1 1 387 388 0=96 1=1 -23310=2,0.000000e+00,6.000000e+00 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=9216 9=3
Convolution              convclip_106             1 1 388 389 0=96 1=3 -23310=2,0.000000e+00,6.000000e+00 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=82944 9=3
Concat                   cat_22                   4 1 336 338 364 389 390 0=0
Convolution              convclip_107             1 1 390 391 0=192 1=1 -23310=2,0.000000e+00,6.000000e+00 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=73728 9=3
Split                    splitncnn_58             1 3 391 392 393 394
Pooling                  avgpool2d_4              1 1 392 395 0=1 1=2 11=2 12=1 13=0 2=1 3=0 5=1 6=1
Convolution              convclip_108             1 1 395 396 0=128 1=3 -23310=2,0.000000e+00,6.000000e+00 11=3 12=1 13=2 14=1 2=1 3=2 4=1 5=1 6=221184 9=3
Concat                   cat_23                   2 1 396 207 397 0=0
Convolution              convclip_109             1 1 397 398 0=256 1=1 -23310=2,0.000000e+00,6.000000e+00 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=98304 9=3
Slice                    chunk_7                  1 2 398 399 400 -23300=2,-233,-233 1=0
Split                    splitncnn_59             1 3 400 401 402 403
Convolution              convclip_110             1 1 403 404 0=64 1=1 -23310=2,0.000000e+00,6.000000e+00 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=8192 9=3
Split                    splitncnn_60             1 2 404 405 406
Convolution              conv_152                 1 1 406 407 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=36864
Swish                    silu_366                 1 1 407 408
Convolution              convclip_111             1 1 408 409 0=64 1=3 -23310=2,0.000000e+00,6.000000e+00 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=36864 9=3
BinaryOp                 add_36                   2 1 405 409 410 0=0
Split                    splitncnn_61             1 2 410 411 412
Convolution              conv_154                 1 1 412 413 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=36864
Swish                    silu_367                 1 1 413 414
Convolution              convclip_112             1 1 414 415 0=64 1=3 -23310=2,0.000000e+00,6.000000e+00 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=36864 9=3
BinaryOp                 add_37                   2 1 411 415 416 0=0
Split                    splitncnn_62             1 2 416 417 418
Convolution              conv_156                 1 1 418 419 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=36864
Swish                    silu_368                 1 1 419 420
Convolution              convclip_113             1 1 420 421 0=64 1=3 -23310=2,0.000000e+00,6.000000e+00 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=36864 9=3
BinaryOp                 add_38                   2 1 417 421 422 0=0
Convolution              convclip_114             1 1 402 423 0=64 1=1 -23310=2,0.000000e+00,6.000000e+00 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=8192 9=3
Concat                   cat_24                   2 1 422 423 424 0=0
Convolution              convclip_115             1 1 424 425 0=128 1=1 -23310=2,0.000000e+00,6.000000e+00 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=16384 9=3
Convolution              convclip_116             1 1 425 426 0=128 1=3 -23310=2,0.000000e+00,6.000000e+00 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=147456 9=3
Split                    splitncnn_63             1 3 426 427 428 429
Convolution              convclip_117             1 1 429 430 0=64 1=1 -23310=2,0.000000e+00,6.000000e+00 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=8192 9=3
Split                    splitncnn_64             1 2 430 431 432
Convolution              conv_162                 1 1 432 433 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=36864
Swish                    silu_369                 1 1 433 434
Convolution              convclip_118             1 1 434 435 0=64 1=3 -23310=2,0.000000e+00,6.000000e+00 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=36864 9=3
BinaryOp                 add_39                   2 1 431 435 436 0=0
Split                    splitncnn_65             1 2 436 437 438
Convolution              conv_164                 1 1 438 439 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=36864
Swish                    silu_370                 1 1 439 440
Convolution              convclip_119             1 1 440 441 0=64 1=3 -23310=2,0.000000e+00,6.000000e+00 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=36864 9=3
BinaryOp                 add_40                   2 1 437 441 442 0=0
Split                    splitncnn_66             1 2 442 443 444
Convolution              conv_166                 1 1 444 445 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=36864
Swish                    silu_371                 1 1 445 446
Convolution              convclip_120             1 1 446 447 0=64 1=3 -23310=2,0.000000e+00,6.000000e+00 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=36864 9=3
BinaryOp                 add_41                   2 1 443 447 448 0=0
Convolution              convclip_121             1 1 428 449 0=64 1=1 -23310=2,0.000000e+00,6.000000e+00 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=8192 9=3
Concat                   cat_25                   2 1 448 449 450 0=0
Convolution              convclip_122             1 1 450 451 0=128 1=1 -23310=2,0.000000e+00,6.000000e+00 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=16384 9=3
Convolution              convclip_123             1 1 451 452 0=128 1=3 -23310=2,0.000000e+00,6.000000e+00 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=147456 9=3
Concat                   cat_26                   4 1 399 401 427 452 453 0=0
Convolution              convclip_124             1 1 453 454 0=256 1=1 -23310=2,0.000000e+00,6.000000e+00 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=131072 9=3
Split                    splitncnn_67             1 2 454 455 456
Convolution              convclip_125             1 1 331 457 0=64 1=3 -23310=2,0.000000e+00,6.000000e+00 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=73728 9=3
Convolution              convclip_126             1 1 457 458 0=64 1=3 -23310=2,0.000000e+00,6.000000e+00 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=36864 9=3
Convolution              conv_174                 1 1 458 out0 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=4096
Convolution              convclip_127             1 1 330 460 0=128 1=3 -23310=2,0.000000e+00,6.000000e+00 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=147456 9=3
Convolution              convclip_128             1 1 460 461 0=128 1=3 -23310=2,0.000000e+00,6.000000e+00 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=147456 9=3
Convolution              conv_177                 1 1 461 out3 0=3 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=384
Convolution              convclip_129             1 1 394 463 0=64 1=3 -23310=2,0.000000e+00,6.000000e+00 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=110592 9=3
Convolution              convclip_130             1 1 463 464 0=64 1=3 -23310=2,0.000000e+00,6.000000e+00 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=36864 9=3
Convolution              conv_180                 1 1 464 out1 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=4096
Convolution              convclip_131             1 1 393 466 0=128 1=3 -23310=2,0.000000e+00,6.000000e+00 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=221184 9=3
Convolution              convclip_132             1 1 466 467 0=128 1=3 -23310=2,0.000000e+00,6.000000e+00 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=147456 9=3
Convolution              conv_183                 1 1 467 out4 0=3 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=384
Convolution              convclip_133             1 1 456 469 0=64 1=3 -23310=2,0.000000e+00,6.000000e+00 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=147456 9=3
Convolution              convclip_134             1 1 469 470 0=64 1=3 -23310=2,0.000000e+00,6.000000e+00 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=36864 9=3
Convolution              conv_186                 1 1 470 out2 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=4096
Convolution              convclip_135             1 1 455 472 0=128 1=3 -23310=2,0.000000e+00,6.000000e+00 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=294912 9=3
Convolution              convclip_136             1 1 472 473 0=128 1=3 -23310=2,0.000000e+00,6.000000e+00 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=147456 9=3
Convolution              conv_189                 1 1 473 out5 0=3 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=384
